export default {
  "方案名称": "紫武",
  "装备信息": {
    "装备基础属性": {
      "基础攻击": 65509,
      "破防等级": 40998,
      "无双等级": 83270,
      "会心等级": 112151,
      "会心效果等级": 31698,
      "全能等级": 0,
      "武器伤害_最小值": 4684,
      "武器伤害_最大值": 7806,
      "破招值": 4160,
      "力道": 44,
      "元气": 4943,
      "身法": 44,
      "根骨": 44,
      "体质": 156892,
      "基础气血上限": 160878,
      "额外气血上限": 0,
      "加速等级": 10968,
      "装分": 600756
    },
    "装备镶嵌附魔属性": {
      "基础攻击": 12309,
      "破防等级": 10934,
      "无双等级": 10640,
      "会心等级": 13793,
      "会心效果等级": 3366,
      "全能等级": 0,
      "武器伤害_最小值": 0,
      "武器伤害_最大值": 0,
      "破招值": 1122,
      "力道": 44,
      "元气": 726,
      "身法": 44,
      "根骨": 44,
      "体质": 45,
      "基础气血上限": 160878,
      "额外气血上限": 0,
      "加速等级": 2801
    },
    "装备列表": [
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atMagicOvercome",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atStrainBase",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 105059,
        "装备部位": "帽子",
        "附魔": "攻击+849"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atMagicCriticalStrike",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atMagicCriticalDamagePowerBase",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 104800,
        "装备部位": "衣服",
        "附魔": "无双+836"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atAllTypeCriticalStrike",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atSurplusValueBase",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 104891,
        "装备部位": "腰带",
        "附魔": "无双+836"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atMagicOvercome",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atStrainBase",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 104921,
        "装备部位": "护腕",
        "附魔": "无双+2801"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atAllTypeCriticalDamagePowerBase",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atStrainBase",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 104949,
        "装备部位": "下装",
        "附魔": "无双+2801"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atMagicAttackPowerBase",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atMagicOvercome",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 104738,
        "装备部位": "鞋子",
        "附魔": "加速+2801"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atMagicOvercome",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 43113,
        "装备部位": "项链",
        "附魔": "元气+539"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atAllTypeCriticalDamagePowerBase",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 43119,
        "装备部位": "腰坠",
        "附魔": "会心+4202"
      },
      {
        "镶嵌孔数组": [],
        "当前精炼等级": 6,
        "id": 43002,
        "装备部位": "戒指",
        "附魔": "攻击+1273"
      },
      {
        "镶嵌孔数组": [],
        "当前精炼等级": 6,
        "id": 43002,
        "装备部位": "戒指",
        "附魔": "攻击+1273"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atMagicOvercome",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 41347,
        "装备部位": "暗器",
        "附魔": "破防+4202"
      },
      {
        "镶嵌孔数组": [
          {
            "镶嵌类型": "atMagicAttackPowerBase",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atSpunkBase",
            "镶嵌宝石等级": 8
          },
          {
            "镶嵌类型": "atMagicOvercome",
            "镶嵌宝石等级": 8
          }
        ],
        "当前精炼等级": 6,
        "id": 41283,
        "装备部位": "武器",
        "附魔": "攻击+849"
      }
    ],
    "五彩石": "彩·星见·灭气·月华(陆)",
    "装备增益": {
      "大附魔_伤帽": 2,
      "大附魔_伤衣": 2,
      "大附魔_伤腰": 2,
      "大附魔_伤腕": 2,
      "大附魔_伤鞋": 2,
      "试炼适应之力": 4,
      "常驻套装会心会效": 1,
      "套装技能": 0,
      "特效_40788": 1,
      "特效_40793": 1,
      "试炼项链会心": 4,
      "试炼腰坠破防": 4,
      "特效_40803": 2,
      "试炼暗器特效": 4,
      "水特效武器": 1
    }
  }
}