export default {
  装备基础属性: {
    基础攻击: 56266,
    破防等级: 71432,
    无双等级: 92364,
    会心等级: 73346,
    会心效果等级: 17140,
    全能等级: 0,
    武器伤害_最小值: 4684,
    武器伤害_最大值: 7806,
    破招值: 9061,
    力道: 44,
    元气: 9364,
    身法: 44,
    根骨: 44,
    体质: 157186,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 2401,
    装分: 596786,
  },
  装备镶嵌附魔属性: {
    基础攻击: 11100,
    破防等级: 4800,
    无双等级: 9116,
    会心等级: 11044,
    会心效果等级: 960,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 960,
    力道: 44,
    元气: 1488,
    身法: 44,
    根骨: 44,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 2401,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSpunkBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104756,
      装备部位: '帽子',
      附魔: '加速+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSpunkBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atAllTypeCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104999,
      装备部位: '衣服',
      附魔: '无双+717',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAllTypeCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104894,
      装备部位: '腰带',
      附魔: '无双+717',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104921,
      装备部位: '护腕',
      附魔: '无双+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAllTypeCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atSurplusValueBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104948,
      装备部位: '下装',
      附魔: '无双+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104725,
      装备部位: '鞋子',
      附魔: '攻击+728',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42940,
      装备部位: '项链',
      附魔: '元气+539',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42988,
      装备部位: '腰坠',
      附魔: '会心+4202',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 43002,
      装备部位: '戒指',
      附魔: '攻击+1273',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 43002,
      装备部位: '戒指',
      附魔: '攻击+1273',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAllTypeCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 41352,
      装备部位: '暗器',
      附魔: '元气+539',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atSpunkBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 41269,
      装备部位: '武器',
      附魔: '攻击+728',
    },
  ],
  五彩石: '彩·鹤顶·无双·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 0,
    切糕会心_英雄: 0,
    切糕无双_英雄: 0,
    特效_2870: 1,
    特效_2869: 1,
    特效_2872: 1,
    风特效腰坠: 2,
    特效_2875: 2,
    水特效武器: 2,
  },
}
