export default {
  装备基础属性: {
    基础攻击: 56774,
    破防等级: 93571,
    无双等级: 98751,
    会心等级: 89248,
    会心效果等级: 19046,
    全能等级: 0,
    武器伤害_最小值: 8212,
    武器伤害_最大值: 13687,
    破招值: 0,
    力道: 44,
    元气: 44,
    身法: 11381,
    根骨: 44,
    体质: 184036,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 10504,
    装分: 701914,
  },
  装备镶嵌附魔属性: {
    基础攻击: 11480,
    破防等级: 7854,
    无双等级: 2794,
    会心等级: 20498,
    会心效果等级: 1122,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 0,
    力道: 44,
    元气: 44,
    身法: 958,
    根骨: 44,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 10504,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106788,
      装备部位: '帽子',
      附魔: '加速+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106820,
      装备部位: '衣服',
      附魔: '无双+836',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106724,
      装备部位: '腰带',
      附魔: '无双+836',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106958,
      装备部位: '护腕',
      附魔: '会心+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106987,
      装备部位: '下装',
      附魔: '会心+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106756,
      装备部位: '鞋子',
      附魔: '加速+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 44308,
      装备部位: '项链',
      附魔: '身法+628',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 8,
      id: 47806,
      装备部位: '腰坠',
      附魔: '会心+4902',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 44364,
      装备部位: '戒指',
      附魔: '攻击+1332',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 44364,
      装备部位: '戒指',
      附魔: '攻击+1332',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42807,
      装备部位: '暗器',
      附魔: '加速+4902',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42732,
      装备部位: '武器',
      附魔: '攻击+761',
    },
  ],
  五彩石: '彩·斩铁·锐刃·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 1,
    特效_40788: 2,
    特效_40793: 2,
    风特效腰坠: 2,
    特效_40803: 2,
    水特效武器: 2,
  },
}
