import 循环主类类型 from '../main'
import { 循环基础技能数据类型, 技能释放记录结果 } from '../type'

class 技能统一类 {
  模拟循环: 循环主类类型 = {} as any
  本次释放记录: 技能释放记录结果 = {}
  本次释放延迟: number | 'GCD' = 0

  constructor(模拟循环) {
    this.模拟循环 = 模拟循环
    return
  }

  折伞落地() {
    // 技能ID 19974
    //TODO
    this.模拟循环.角色状态信息.体态 = '落地'
    this.模拟循环.卸除buff?.({ 名称: '物化天行', 对象: '自身' })
    this.模拟循环.卸除buff?.({ 名称: '浮游天地', 对象: '自身' })
    this.模拟循环?.技能类实例集合?.['飘遥伞击']?.刷新伞击序列()
  }

  检查GCD(索引, 当前技能?: 循环基础技能数据类型) {
    const 后一个技能 = this.模拟循环?.测试循环?.[索引 + 1]
    const GCD组 = 当前技能?.技能GCD组 === '自身' ? 当前技能?.技能名称 : 当前技能?.技能GCD组 || ''
    let GCD = this.模拟循环?.GCD组?.[GCD组] || 0
    let 等待GCD = 0
    if (this.本次释放延迟) {
      // 如果存在后面的技能，判断后面的技能当前的GCD为多少，推进到后一个技能。这样可以让灭卡在后面的技能释放前释放
      if (后一个技能) {
        const 当前技能 = this?.模拟循环?.技能基础数据?.find((item) => item?.技能名称 === 后一个技能)
        if (当前技能 && 当前技能?.技能GCD组) {
          const 技能实例 = this?.模拟循环?.技能类实例集合?.[当前技能?.技能名称]
          const 后一个技能GCD = this.模拟循环?.检查GCD?.(当前技能, 技能实例, 索引 + 1) || 0
          if (this.本次释放延迟 === 'GCD') {
            等待GCD = 后一个技能GCD
          } else {
            等待GCD = Math.min(后一个技能GCD, Number(this.本次释放延迟))
          }
        }
      }
      if (等待GCD) {
        GCD = Math.max(等待GCD, GCD)
      }
    }

    this.本次释放延迟 = 0

    return GCD
  }

  释放前初始化(额外信息) {
    if (额外信息?.延迟) {
      this.本次释放延迟 = 额外信息?.延迟
    }
    // 重置释放记录
    this.本次释放记录 = {}
  }

  怒翼判定() {
    if (this.模拟循环.校验奇穴是否存在('怒翼')) {
      if (this.模拟循环.当前自身buff列表?.['怒翼']?.当前层数) {
        return true
      }
    } else {
      return false
    }
  }

  清源判定() {
    if (this.模拟循环.校验奇穴是否存在('清源')) {
      const 清源1层数 = this.模拟循环.当前自身buff列表?.['清源·1']?.当前层数
      const 清源2层数 = this.模拟循环.当前自身buff列表?.['清源·2']?.当前层数
      const 清源3层数 = this.模拟循环.当前自身buff列表?.['清源·3']?.当前层数
      if (!清源1层数 && !清源2层数 && !清源3层数) {
        // 添加两层击水buff
        this.模拟循环.添加buff?.({ 名称: '清源·1', 对象: '自身' })
      } else if (清源1层数) {
        // 消耗一层击水buff
        this.模拟循环.卸除buff?.({ 名称: '清源·1', 对象: '自身' })
        this.模拟循环.添加buff?.({ 名称: '清源·2', 对象: '自身' })
      } else if (清源2层数) {
        this.模拟循环.卸除buff?.({ 名称: '清源·2', 对象: '自身' })
        this.模拟循环.添加buff?.({ 名称: '清源·3', 对象: '自身' })
      } else if (清源3层数) {
        this.模拟循环.添加buff?.({ 名称: '清源·3', 对象: '自身' })
      }
    }
  }

  澄穆判定() {
    if (this.模拟循环.校验奇穴是否存在('澄穆')) {
      const 澄穆1层数 = this.模拟循环.当前自身buff列表?.['澄穆·1']?.当前层数
      const 澄穆2层数 = this.模拟循环.当前自身buff列表?.['澄穆·2']?.当前层数
      const 澄穆3层数 = this.模拟循环.当前自身buff列表?.['澄穆·3']?.当前层数
      if (!澄穆1层数 && !澄穆2层数 && !澄穆3层数) {
        // 添加两层击水buff
        this.模拟循环.添加buff?.({ 名称: '澄穆·1', 对象: '自身' })
      } else if (澄穆1层数) {
        // 消耗一层击水buff
        this.模拟循环.卸除buff?.({ 名称: '澄穆·1', 对象: '自身' })
        this.模拟循环.添加buff?.({ 名称: '澄穆·2', 对象: '自身' })
      } else if (澄穆2层数) {
        this.模拟循环.卸除buff?.({ 名称: '澄穆·2', 对象: '自身' })
        this.模拟循环.添加buff?.({ 名称: '澄穆·3', 对象: '自身' })
      } else if (澄穆3层数) {
        this.模拟循环.添加buff?.({ 名称: '澄穆·3', 对象: '自身' })
      }
    }
  }

  海碧判定() {
    if (this.模拟循环.校验奇穴是否存在('海碧')) {
      if (this.模拟循环.角色状态信息.体态 === '落地') {
        this.模拟循环.添加buff?.({ 名称: '海碧', 对象: '自身' })
      } else if (this.模拟循环.角色状态信息.体态 === '物化天行') {
        const 海碧层数 = this.模拟循环.当前自身buff列表?.['海碧']?.当前层数 || 0
        if (海碧层数 > 2) {
          return true
        }
      }
      return false
    }
    return false
  }

  海碧结算() {
    this?.模拟循环?.技能类实例集合?.['驰风震域']?.获得驰风震域海碧()
    this.模拟循环.卸除buff?.({ 名称: '海碧', 对象: '自身', 卸除层数: 3 })
  }

  驰风震域存续判定() {
    return (
      this.模拟循环.当前目标buff列表?.['驰风震域']?.当前层数 ||
      this.模拟循环.当前目标buff列表?.['驰风震域·海碧']?.当前层数
    )
  }

  鸿轨判定() {
    return (
      this.模拟循环.校验奇穴是否存在('鸿轨') &&
      this.驰风震域存续判定() &&
      this.模拟循环.角色状态信息.体态 !== '落地'
    )
  }

  引爆青冥(来源) {
    this?.模拟循环?.技能类实例集合?.['青冥']?.引爆青冥判定(1, 来源)
  }

  触发伤害行为(
    伤害名称,
    伤害次数 = 1,
    额外增益列表: string[] = [],
    触发伤害时间: number | undefined = undefined,
    技能等级 = 1,
  ) {
    // 判断玉枕
    const 增益列表 = [...额外增益列表]
    const 快照检测Buff列表 = this.获取DOT快照检测Buff列表(伤害名称)

    // 当前技能数据?.宠物伤害
    // if (
    //   this.模拟循环.校验奇穴是否存在('玉枕') &&
    //   this.模拟循环.当前自身buff列表?.['经脉循行']?.当前层数
    // ) {
    //   增益列表.push('玉枕')
    // }
    this.模拟循环.技能造成伤害?.(
      伤害名称,
      伤害次数,
      增益列表,
      触发伤害时间,
      false,
      技能等级,
      快照检测Buff列表,
    )

    if (!伤害名称?.includes('DOT') && !伤害名称?.includes('破')) {
      const 触发怒翼 = this.怒翼判定()
      if (触发怒翼) {
        this.模拟循环.技能造成伤害?.('怒翼', 1, 增益列表, 触发伤害时间, false, 1)
      }
    }
  }

  获取DOT快照检测Buff列表(伤害名称) {
    if (伤害名称?.includes('DOT')) {
      return ['太息·1', '太息·2']
    } else {
      return []
    }
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
    }
  }

  获取当前重要buff列表(技能依赖自身buff列表: string[] = [], 技能依赖目标buff列表: string[] = []) {
    const 重要buff列表: string[] = []
    技能依赖自身buff列表.forEach((buff) => {
      if (this.模拟循环.当前自身buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    技能依赖目标buff列表.forEach((buff) => {
      if (this.模拟循环.当前目标buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    return 重要buff列表 || []
  }

  获取施加重要buff信息(buff名称) {
    const 当前时间 = this.模拟循环.当前时间 || 0
    const buff对象 = this.模拟循环.Buff和Dot数据?.[buff名称]

    return buff对象
      ? {
          buff名称: buff名称,
          buff开始时间: 当前时间,
          buff结束时间: 当前时间 + (buff对象?.最大持续时间 || 0),
        }
      : null
  }
}

export default 技能统一类
