import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import 通用增益 from './通用增益/通用增益'
import 大橙武技能增益 from './通用增益/大橙武技能增益'

const 蚀肌弹增益: 技能增益列表类型[] = [
  ...通用增益,
  ...大橙武技能增益,
  {
    增益名称: '天魔蚀肌',
    依赖奇穴: '天魔蚀肌',
    增益所在位置: '奇穴',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 102 / 1024 }],
  },
  {
    增益名称: '毒手尊拳',
    依赖奇穴: '毒手尊拳',
    增益所在位置: '奇穴',
    增益类型: '全局启用',
    增益集合: [
      { 属性: 属性类型.全会心百分比, 值: 0.1 },
      { 属性: 属性类型.郭氏全会心效果等级, 值: 102 },
    ],
  },
  {
    增益名称: '减读条_1',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [],
    // prepare_frame - 2
  },
  {
    增益名称: '减读条_2',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [],
    // prepare_frame - 2
  },
  {
    增益名称: '5%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 51 / 1024 }],
  },
  {
    增益名称: '4%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
  {
    增益名称: '4%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.04 }],
  },
  {
    增益名称: '3%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.03 }],
  },
]

export default 蚀肌弹增益
