import { 每秒郭氏帧 } from '@/数据/常量'
import { 待生效事件 } from '../../type'
import 技能统一类 from '../../通用类/技能统一类'

class 丹青 extends 技能统一类 {
  // scripts/skill/万花/万花_百花拂穴手_丹青.lua
  // scripts/skill/万花/花间_墨鸟飞掠气场每秒aoe.lua

  constructor(模拟循环) {
    super(模拟循环)
  }

  丹青初始化() {
    this?.模拟循环?.删除待生效事件队列('雨墨判定')
    this?.添加丹青序列()
    this?.添加雨墨序列()
  }

  添加丹青序列() {
    // 延迟1.5秒一次鸟伤害
    const 待生效事件队列: 待生效事件[] = [
      {
        事件名称: '丹青判定',
        事件时间: this?.模拟循环?.当前时间 + 每秒郭氏帧 * 1.5,
      },
    ]
    this.模拟循环.添加待生效事件队列(待生效事件队列)
    this.模拟循环.添加buff({ 名称: '丹青', 对象: '目标' })
  }

  丹青命中() {
    this?.触发伤害行为('丹青')
    this?.涓流函数()
  }

  添加雨墨序列() {
    // 每2秒一次伤害，触发dot
    const 待生效事件队列: 待生效事件[] = []
    for (let i = 1; i <= 3; i++) {
      待生效事件队列.push({
        事件名称: '雨墨判定',
        事件时间: this?.模拟循环?.当前时间 + i * 每秒郭氏帧 * 2,
      })
    }
    this.模拟循环.添加buff({ 名称: '雨墨', 对象: '目标' })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  雨墨命中() {
    this?.触发伤害行为('雨墨')
    this?.模拟循环?.技能类实例集合?.DOT_商阳指?.丹青吞噬()
    this?.模拟循环?.技能类实例集合?.DOT_钟林毓秀?.丹青吞噬()
    this?.模拟循环?.技能类实例集合?.DOT_兰摧玉折?.丹青吞噬()
  }
}

export default 丹青

export const 丹青类型 = typeof 丹青
