import {
  副本精简特效枚举,
  装备属性信息模型,
  装备特效枚举,
  装备类型枚举,
  试炼之地特效枚举,
} from '@/@types/装备'
import { 装备速查数据 } from './interface'
import 获取当前数据 from '@/数据/数据工具/获取当前数据'
import { 属性类型 } from '@/@types/属性'
import { 获取武伤附魔数据 } from '@/数据/附魔/武器伤害附魔'
import {
  获取副本特效增益表现,
  获取橙武特效等级表现,
  获取试炼之地增益表现,
} from '@/功能模块/基础设置/属性录入/配装器/工具函数/根据装备信息获取基础属性/装备特效判断'
import { 本赛季英雄品级 } from '@/数据/常量/装备常量'
import { 装备特效存在等级 } from '@/数据/装备/装备增益数据'
import {
  获取装备精炼装分,
  装备位置部位枚举,
  装备原始装分,
} from '@/功能模块/基础设置/属性录入/配装器/工具函数/装分计算/工具函数/装备分数'

const { 附魔, 装备增益数据, 主属性 } = 获取当前数据()

export const 分数放大系数 = 1000

/**
 * @NAME 容量分数计算规则
 * 以附魔为基础分数
 * 使用属性和附魔数值的比例计算出一个分数
 */

const 计算装备容量 = (原始数据: 装备属性信息模型[], 装备部位): 装备速查数据[] => {
  const 附魔 = 获取当前各属性最大附魔()
  const 武伤附魔 = 获取武伤附魔数据('力道')
  const 武伤最大附魔 = 武伤附魔?.[0]
  附魔.push({
    属性: 属性类型.武器伤害,
    值: 武伤最大附魔?.增益集合?.[0]?.值 || 0,
  })

  return 原始数据.map((item) => {
    const 属性容量 = 计算装备属性容量(item, 附魔) || 0
    const 特效容量 = 计算装备特效容量(item, 附魔) || 0
    const 总容量 = 属性容量 + 特效容量
    const 装备质量 = item.装备类型 === 装备类型枚举.橙武 ? '5' : '4'
    const 装备部位映射 = 装备位置部位枚举?.[装备部位]
    const 装备原始分数 = 装备原始装分(item.装备品级, 装备质量, 装备部位映射)
    const 精炼分数 = 获取装备精炼装分(装备原始分数, 装备质量 === '5' ? 8 : 6)
    const 装备总分 = 装备原始分数 + 精炼分数
    if (!装备总分) {
      console.error('装备分数计算错误', item)
    }
    return {
      ...item,
      属性容量,
      特效容量: 特效容量,
      容量装分比: 总容量 / 装备总分,
    }
  })
}

const 计算装备属性容量 = (data: 装备属性信息模型, 附魔) => {
  let 容量分数 = 0
  data?.装备增益?.forEach((item) => {
    const 附魔属性 = 装备和附魔属性转换(item.属性)
    const 附魔数值 = item?.值 || 0
    const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 附魔属性)?.值 || 0
    if (附魔最大数值) {
      容量分数 += (附魔数值 / 附魔最大数值) * 分数放大系数
    } else {
      console.error('容量计算错误', item, data)
    }
  })
  if (data?.武器伤害_最大值) {
    const 平均武器伤害 = (data?.武器伤害_最小值 || 0) + (data?.武器伤害_最大值 || 0) / 2
    if (平均武器伤害) {
      const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 属性类型.武器伤害)?.值 || 0
      if (附魔最大数值) {
        容量分数 += (平均武器伤害 / 附魔最大数值) * 分数放大系数
      } else {
        console.error('容量计算错误', data)
      }
    }
  }
  return 容量分数
}

const 计算装备特效容量 = (data: 装备属性信息模型, 附魔) => {
  let 容量分数 = 0
  if (data?.装备特效) {
    const 特效表现 = 获取增益表现(data) || 1
    const 增益数据 = 装备增益数据?.[data?.装备特效]
    switch (data?.装备特效) {
      case 装备特效枚举.水特效武器:
      case 装备特效枚举.特效_40790:
      case 装备特效枚举.特效_40793:
      case 装备特效枚举.特效_40802:
      case 装备特效枚举.特效_40803:
      case 装备特效枚举.特效_41065:
      case 装备特效枚举.特效_40804:
      case 装备特效枚举.试炼鞋子破防:
      case 装备特效枚举.试炼鞋子会心:
      case 装备特效枚举.试炼腰坠会效:
      case 装备特效枚举.试炼腰坠破防:
      case 装备特效枚举.大橙武特效:
        if (增益数据?.length) {
          增益数据?.forEach((增益) => {
            const 对应实际值 = 增益?.值?.[特效表现 - 1]
            const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 增益?.属性)?.值 || 0
            if (对应实际值) {
              if (附魔最大数值) {
                容量分数 += (对应实际值 / 附魔最大数值) * 分数放大系数
              } else {
                console.error('找不到对应附魔值', data, 增益数据)
              }
            } else {
              console.error('找不到对应增益值', data, 增益数据)
            }
          })
        }
        break
      case 装备特效枚举.风特效腰坠:
        if (特效表现) {
          const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 属性类型.全破防等级)?.值 || 0
          const 等级加成数值 = 装备增益数据?.[装备特效枚举.风特效腰坠]?.[0]?.值 || []
          const 加成数值 = 等级加成数值[特效表现 - 1] || 0
          容量分数 += ((加成数值 * 15) / 180 / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.试炼适应之力:
        if (特效表现) {
          const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 属性类型.全破防等级)?.值 || 0
          const 等级加成数值 = [2440, 2540, 2356, 2542, 2735, 2971]
          const 加成数值 = 等级加成数值[特效表现 - 1] || 0
          容量分数 += (加成数值 / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.试炼项链会心:
        if (特效表现) {
          const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 属性类型.全会心等级)?.值 || 0
          const 等级加成数值 = [109, 114, 130, 141, 151, 165]
          const 加成数值 = 等级加成数值[特效表现 - 1] || 0
          容量分数 += ((加成数值 * 10) / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.试炼项链破防:
        if (特效表现) {
          const 等级加成数值 =
            主属性 === '力道' || 主属性 === '身法'
              ? [33, 35, 38, 42, 46, 50]
              : [30, 32, 35, 38, 37, 41]
          const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 属性类型.全基础攻击)?.值 || 0
          const 加成数值 = 等级加成数值[特效表现 - 1] || 0
          容量分数 += ((加成数值 * 10) / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.特效_40794:
        if (特效表现) {
          const 等级加成数值 = [12152, 17507]
          const 加成数值 = 等级加成数值[特效表现 - 1] || 0
          const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 属性类型.全会心等级)?.值 || 0
          容量分数 += (加成数值 / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.特效_40791:
        if (特效表现) {
          const 等级加成数值 = [8506, 12254]
          const 加成数值 = 等级加成数值[特效表现 - 1] || 0
          const 附魔最大数值 = 附魔?.find((item) => item?.属性 === 属性类型.全会心等级)?.值 || 0
          容量分数 += (加成数值 / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      default:
        console.info('未计算特效', data?.装备特效)
        break
    }
    return 容量分数
  } else {
    return 0
  }
}

const 获取增益表现 = (该装备属性) => {
  let 增益表现 = 1
  if (副本精简特效枚举?.[该装备属性?.装备特效]) {
    // 判断试炼之地特效
    增益表现 = 获取副本特效增益表现(该装备属性?.装备品级, 该装备属性?.特效等级)
  } else if (试炼之地特效枚举?.[该装备属性?.装备特效]) {
    // 判断试炼之地特效
    增益表现 = 获取试炼之地增益表现(该装备属性?.装备品级, 该装备属性?.特效等级)
  } else if (该装备属性?.装备特效 === 装备特效枚举.大橙武特效) {
    // 判断大橙武特效
    增益表现 = 获取橙武特效等级表现(该装备属性?.装备品级)
  } else if (
    // 判断英雄品特效 水特效、风特效
    该装备属性?.装备品级 >= 本赛季英雄品级 &&
    装备特效存在等级?.includes(该装备属性?.装备特效)
  ) {
    增益表现 = 2
  }
  return 增益表现
}

// 将部分内功/外功转换为全加成
const 装备和附魔属性转换 = (属性) => {
  if (属性.includes('AttackPowerBase')) {
    return 属性类型.全基础攻击
  } else if (属性.includes('Overcome')) {
    return 属性类型.全破防等级
  } else if (属性.includes('CriticalStrike')) {
    return 属性类型.全会心等级
  } else if (属性.includes('CriticalDamagePowerBase')) {
    return 属性类型.全会心效果等级
  }
  return 属性
}

export const 获取当前各属性最大附魔 = () => {
  const res = {}
  附魔?.forEach((item) => {
    if (item?.挑战附魔) {
      return
    }
    const 附魔属性 = item?.增益集合?.[0]?.属性 || ''
    const 附魔数值 = item?.增益集合?.[0]?.值 || 0
    if (!res?.[附魔属性] || res[附魔属性] < 附魔数值) {
      res[附魔属性] = 附魔数值
    }
  })
  const resList = Object.keys(res).map((key) => {
    return {
      属性: key,
      值: res[key],
    }
  })

  const 无双数据 = resList?.find((item) => item?.属性 === 属性类型.无双等级)?.值
  resList.push({
    属性: 属性类型.全能等级,
    值: Math.floor(无双数据 / 2),
  })

  return resList
}

export default 计算装备容量
