import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '武勇',
        奇穴图片: 'https://icon.jx3box.com/icon/4903.png',
        id: '6809',
        奇穴描述: '“拨狗朝天”“横打双獒”伤害提高10%。',
      },
      {
        奇穴名称: '玄黄',
        奇穴图片: 'https://icon.jx3box.com/icon/4900.png',
        id: '6812',
        奇穴描述: '“亢龙有悔”的伤害提高10%。',
      },
      {
        奇穴名称: '安患',
        奇穴图片: 'https://icon.jx3box.com/icon/4597.png',
        id: '6811',
        奇穴描述: '“棒打狗头”能够解除自身锁足和减速不利效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '坚冰',
        奇穴图片: 'https://icon.jx3box.com/icon/13393.png',
        id: '26702',
        奇穴描述: '每10次连击数将会有“灵隼”对自身前方6尺360度范围最多5个目标造成外功伤害。',
      },
      {
        奇穴名称: '御龙',
        奇穴图片: 'https://icon.jx3box.com/icon/4744.png',
        id: '6813',
        奇穴描述: '“断江流”的距离提高至8尺。',
      },
      {
        奇穴名称: '益元',
        奇穴图片: 'https://icon.jx3box.com/icon/4748.png',
        id: '6836',
        奇穴描述: '“蛟龙翻江”调息时间降低5秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '洪荒',
        奇穴图片: 'https://icon.jx3box.com/icon/4898.png',
        id: '21284',
        奇穴描述: '“亢龙有悔”对4尺外目标施展会附带冲刺效果。',
      },
      {
        奇穴名称: '流形',
        奇穴图片: 'https://icon.jx3box.com/icon/4609.png',
        id: '6833',
        奇穴描述: '每10次连击数使得自身受到伤害降低2%，最多可叠加10层，持续20秒。',
      },
      {
        奇穴名称: '自强',
        奇穴图片: 'https://icon.jx3box.com/icon/4907.png',
        id: '6845',
        奇穴描述: '“蜀犬吠日”招式伤害提高20%，施展后恢复所有内力。',
      },
      {
        奇穴名称: '饮莫停',
        奇穴图片: 'https://icon.jx3box.com/icon/19161.png',
        id: '6337',
        奇穴描述:
          '冲向目标，以烈酒攻击对方，攻击结束后目标倒地3秒，起身后获得12秒“宿醉”效果，持续期间移动释放招式则会眩晕2秒，每触发一次眩晕将扣除4秒“宿醉”持续时间。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '仁德',
        奇穴图片: 'https://icon.jx3box.com/icon/14092.png',
        id: '26701',
        奇穴描述:
          '“蜀犬吠日”不再需要施展目标，自身向前挥击打狗棒攻击前方的目标并添加“踉跄”效果，施展时自身僵直时间和造成控制时间延长且抵挡受到的伤害，若招式没有命中过目标则返还6秒“蜀犬吠日”调息时间。',
      },
      {
        奇穴名称: '无疆',
        奇穴图片: 'https://icon.jx3box.com/icon/4746.png',
        id: '6820',
        奇穴描述: '施展伤害招式后，若自身内力大于70%，则外功基础攻击提高15%，持续30秒。',
      },
      {
        奇穴名称: '战龙',
        奇穴图片: 'https://icon.jx3box.com/icon/4896.png',
        id: '6821',
        奇穴描述: '战斗状态下自身内力值大于70%时，则使自身受到的伤害降低25%，持续10秒。',
      },
      {
        奇穴名称: '复征',
        奇穴图片: 'https://icon.jx3box.com/icon/11305.png',
        id: '40646',
        奇穴描述: '施展“醉逍遥”时，使自身周围6尺内的3个敌对侠士目标4秒内无法施展内功和外功招式。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '醉步',
        奇穴图片: 'https://icon.jx3box.com/icon/4593.png',
        id: '38654',
        奇穴描述: '“恶狗拦路”只能使目标“蹑云逐月”无法施展，但效果持续时间提高5秒。',
      },
      {
        奇穴名称: '酩酊',
        奇穴图片: 'https://icon.jx3box.com/icon/18286.png',
        id: '32725',
        奇穴描述: '施展“酒中仙”额外获得10%内力，并使下一个“亢龙有悔”触发的额外伤害提高20%。',
      },
      {
        奇穴名称: '烟霞',
        奇穴图片: 'https://icon.jx3box.com/icon/4595.png',
        id: '6834',
        奇穴描述:
          '“烟雨行”施展后使下两次“打狗棒法”套路下招式命中目标后额外造成外功伤害，若招式施展招式为“棒打狗头”则额外恢复10%内力，并自身移动速度提高30%，持续6秒。',
      },
      {
        奇穴名称: '凤歌',
        奇穴图片: 'https://icon.jx3box.com/icon/4891.png',
        id: '25194',
        奇穴描述:
          '“狂龙乱舞”结束落地时会额外造成一次5尺范围对5个目标的外功伤害，“狂龙乱舞”期间命中目标的次数越多，范围伤害越高。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '有攸',
        奇穴图片: 'https://icon.jx3box.com/icon/7458.png',
        id: '14628',
        奇穴描述: '施展“龙腾五岳”后，下一次亢龙有悔伤害提高40%，5秒后衰减为20%。',
      },
      {
        奇穴名称: '飞龙',
        奇穴图片: 'https://icon.jx3box.com/icon/4887.png',
        id: '6828',
        奇穴描述: '“笑醉狂”运功期间不受沉默、缴械影响，完整运功额外恢复20%气血值内力值。',
      },
      {
        奇穴名称: '对酌',
        奇穴图片: 'https://icon.jx3box.com/icon/14094.png',
        id: '6839',
        奇穴描述:
          '施展“酒中仙”时，当前选择的30尺内团队目标将与自身进入12秒“对酌”，双方携带“对酌”并施展伤害招式在3秒内命中同一个敌方目标时，对目标造成伤害并降低其调息速度50%，持续4秒，“对酌”效果每30秒只会触发一次。',
      },
      {
        奇穴名称: '越渊',
        奇穴图片: 'https://icon.jx3box.com/icon/4752.png',
        id: '6832',
        奇穴描述:
          '招式对非侠士目标提高6%，自身招式内力消耗降低25%，无视目标50%外功防御，进入状态后该效果消失。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '满盈',
        奇穴图片: 'https://icon.jx3box.com/icon/4892.png',
        id: '38656',
        奇穴描述: '“笑醉狂”可以移动施展，期间移动速度提高100%。',
      },
      {
        奇穴名称: '落水打狗',
        奇穴图片: 'https://icon.jx3box.com/icon/4888.png',
        id: '6810',
        奇穴描述:
          '“天下无狗”调息时间提高37秒，不再恢复内力，完整蓄力后，每段“天下无狗”将消耗20点“醉意”，命中目标后会叠加一层“落水打狗”效果。',
      },
      {
        奇穴名称: '温酒',
        奇穴图片: 'https://icon.jx3box.com/icon/11846.png',
        id: '28818',
        奇穴描述:
          '“昊破”持续期间施展“降龙掌”套路招式命中目标会造成额外伤害，该伤害无视35%的化劲等级。',
      },
      {
        奇穴名称: '知至',
        奇穴图片: 'https://icon.jx3box.com/icon/4895.png',
        id: '6830',
        奇穴描述:
          '“龙啸九天”每命中一个目标，减伤效果持续时间增加1秒并回复5%气血值，同时“龙啸九天”能够击毁攻击范围内最多5个气场和可见机关。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '雨龙',
        奇穴图片: 'https://icon.jx3box.com/icon/4593.png',
        id: '6818',
        奇穴描述: '“灼烧”效果持续时间提高100%，可叠加10层。',
      },
      {
        奇穴名称: '驯致',
        奇穴图片: 'https://icon.jx3box.com/icon/4749.png',
        id: '6824',
        奇穴描述: '“亢龙有悔”施展时间缩短，所有伤害分三掌打出，且该伤害提高60%。',
      },
      {
        奇穴名称: '亢野',
        奇穴图片: 'https://icon.jx3box.com/icon/4896.png',
        id: '14633',
        奇穴描述:
          '“亢龙有悔”调息时间提高至4秒，向前方一掌打出飞龙气劲，对其经过路径上的敌对目标造成伤害，并回复50%内力，施展时内力越高，伤害越高且范围越大。',
      },
      {
        奇穴名称: '龙醒',
        奇穴图片: 'https://icon.jx3box.com/icon/14091.png',
        id: '30774',
        奇穴描述:
          '“亢龙有悔”调息时间增加至8秒，施展消耗20%内力，施展获得“霸体”的同时获得20%最大生命值的护盾，护盾存在时使自身下一招“亢龙有悔”招式伤害不断提高，护盾在霸体效果结束或刷新的4秒后消失。',
      },
      {
        奇穴名称: '接舆',
        奇穴图片: 'https://icon.jx3box.com/icon/11842.png',
        id: '25184',
        奇穴描述: '“时乘六龙”也会使拥有“荡扬”效果的目标获得“灼烧”效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '易损',
        奇穴图片: 'https://icon.jx3box.com/icon/4602.png',
        id: '37339',
        奇穴描述:
          '“蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”3秒内连续命中目标则每次伤害额外提高30%。',
      },
      {
        奇穴名称: '贞固',
        奇穴图片: 'https://icon.jx3box.com/icon/4893.png',
        id: '6822',
        奇穴描述:
          '施展“龙腾五岳”命中侠士目标后，处于“逍遥”状态或30秒内下一次进入“逍遥”状态时施展“龙战于野”“龙跃于渊”“亢龙有悔”自身不会进入僵直，持续10秒。',
      },
      {
        奇穴名称: '留魄',
        奇穴图片: 'https://icon.jx3box.com/icon/17699.png',
        id: '32731',
        奇穴描述:
          '“亢龙有悔”命中拥有“恶狗拦路”不利效果且未被自身击出“心窍”的目标时，会将其“心窍”击出至身后最远12尺位置，“心窍”存在期间目标的所有减伤效果降低20%并每秒受到外功伤害，目标可以靠近并消除“心窍”并受到伤害，“心窍”存在时间越长，造成的伤害越高，在产生6秒后消除并对目标造成伤害。',
      },
      {
        奇穴名称: '催盏',
        奇穴图片: 'https://icon.jx3box.com/icon/4900.png',
        id: '15212',
        奇穴描述: '“灼烧”被卸除不会消失，而是转移至被卸除目标30尺内的其他小队成员身上。',
      },
      {
        奇穴名称: '追远',
        奇穴图片: 'https://icon.jx3box.com/icon/4750.png',
        id: '38878',
        奇穴描述:
          '“拨狗朝天”“横打双獒”命中目标会获得1个破招点数。触发破招伤害时会额外追加点外功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '含弘',
        奇穴图片: 'https://icon.jx3box.com/icon/4908.png',
        id: '6843',
        奇穴描述:
          '当多于50%、60%、70%内力时施展“亢龙有悔”，使自身技能伤害分别提高5%、10%、20%，持续12秒。',
      },
      {
        奇穴名称: '息元',
        奇穴图片: 'https://icon.jx3box.com/icon/4744.png',
        id: '6842',
        奇穴描述: '“逍遥”状态下“亢龙有悔”“龙啸九天”的自身僵直时间减少30%。',
      },
      {
        奇穴名称: '复礼',
        奇穴图片: 'https://icon.jx3box.com/icon/4746.png',
        id: '6814',
        奇穴描述: '少于50%内力时施展“亢龙有悔”，使自身技能伤害提高15%，持续12秒。',
      },
      {
        奇穴名称: '宽野',
        奇穴图片: 'https://icon.jx3box.com/icon/4881.png',
        id: '15211',
        奇穴描述:
          '“龙腾五岳”不再给目标添加“翻江”效果，而是使目标剩余“翻江”时间转换为重创，每6秒“翻江”将转化为1层“重创”，最多转化2层。',
      },
      {
        奇穴名称: '腾龙',
        奇穴图片: 'https://icon.jx3box.com/icon/18285.png',
        id: '32740',
        奇穴描述:
          '施展“烟雨行”会对路径上的敌对目标造成外功伤害，并有35%几率使其获得一层“荡扬”效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '饮江',
        奇穴图片: 'https://icon.jx3box.com/icon/7259.png',
        id: '14625',
        奇穴描述: '“龙跃于渊”将对有自身“灼烧”效果已达到层数上限的目标造成额外伤害。',
      },
      {
        奇穴名称: '不息',
        奇穴图片: 'https://icon.jx3box.com/icon/4587.png',
        id: '40725',
        奇穴描述: '每层“荡扬”使敌方侠士目标被会心几率提高3%。',
      },
      {
        奇穴名称: '将进酒',
        奇穴图片: 'https://icon.jx3box.com/icon/19160.png',
        id: '25186',
        奇穴描述:
          '只能对处于受控状态的目标施展，施展后会首先解除其受控状态，若目标处于被击僵直或挑飞状态，则会将目标击晕4秒，造成外功伤害并返还该招式40%调息时间；若目标处于其他控制状态，则将其“挑飞”，对其施展骤雨般的攻击造成外功伤害，施展过程中获得霸体效果，不受控制效果的影响（被拉除外）。',
      },
      {
        奇穴名称: '无咎',
        奇穴图片: 'https://icon.jx3box.com/icon/7227.png',
        id: '14626',
        奇穴描述: '“龙啸九天”变成2层充能招式，充能时间43秒。',
      },
      {
        奇穴名称: '祭湘君',
        奇穴图片: 'https://icon.jx3box.com/icon/14095.png',
        id: '25197',
        奇穴描述:
          '在自身位置形成“祭湘君”8尺范围区域，每2秒对区域内最多5个目标造成外功伤害，持续12秒。自身位于其中受到的范围伤害降低80%，施展“拨狗朝天”“横打双獒”会额外恢复5%内力。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '苍龙戾天',
        奇穴图片: 'https://icon.jx3box.com/icon/11845.png',
        id: '37385',
        奇穴描述:
          '解除自身僵直状态，腾空跃起，延迟后向目标位置打出一掌，对半径10尺范围3个敌对目标造成外功伤害，施展期间区域内敌对目标会受到减速效果，中心4尺范围内的目标被该招式命中将受到更高的伤害以及3秒眩晕效果。该招式不可在跳跃中施展，施展过程中自身受到的伤害降低70%并获得龙威效果。',
      },
      {
        奇穴名称: '城复于隍',
        奇穴图片: 'https://icon.jx3box.com/icon/16196.png',
        id: '28989',
        奇穴描述:
          '施展后解除自身施展招式的僵直效果并原地蓄力，将骤雨般的连击转化为摧城之力，片刻后冲向目标将其击退，最低造成点外功伤害，最高造成点外功伤害。侠士目标被命中期间会暂时失去援助，无法被其友方选中施展招式。释放时更高的连击数会将目标击退更远，造成更高的伤害，击退距离最远24尺。',
      },
      {
        奇穴名称: '潜龙勿用',
        奇穴图片: 'https://icon.jx3box.com/icon/4908.png',
        id: '40331',
        奇穴描述:
          '需要30%以上内力才能施展。终结技，结束时消耗所有内力，对8尺范围5个目标持续造成点外功伤害，该伤害对非侠士目标提高120%，消耗蓝量越多，持续时间越久。',
      },
      {
        奇穴名称: '御鸿于天',
        奇穴图片: 'https://icon.jx3box.com/icon/7501.png',
        id: '14927',
        奇穴描述:
          '消耗10%内力，对目标造成点外功伤害，并移除目标身上属于自身的“灼烧”持续伤害效果，每层“灼烧”使自身获得5秒“青龙”效果，对被击僵直、定身、眩晕状态下的目标伤害提高35%，持续时间内再次施展可将持续伤害效果作用于新目标。',
      },
      {
        奇穴名称: '神龙降世',
        奇穴图片: 'https://icon.jx3box.com/icon/17207.png',
        id: '30835',
        奇穴描述:
          '“狂龙乱舞”、“飞龙在天”、“犬牙交错”、“龙游天地”施展后方可施展。自身腾空而起获得“霸体”效果并向前砸出气印，并“挑飞”半径8尺范围的5个目标造成点外功伤害，战斗状态下施展招式使该招式伤害提高8%，最多叠加10次，持续30秒。',
      },
    ],
  },
]

export default 奇穴数据
