// import 循环主类 from '../main'
// import { 每秒郭氏帧 } from '@/数据/常量'
import { 获取倒读条实际帧数分布, 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'
import { 每秒郭氏帧 } from '@/数据/常量'

class 锁神 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '锁神')
  static 作用总间隔 = 40
  static 作用间隔帧 = 10

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
  }

  获取读条时间() {
    // 根据加速修改实际读条帧
    const 读条持续时间 = 获取实际帧数(锁神.作用总间隔, this.模拟循环.加速值)
    return 读条持续时间
  }

  读条(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    const 循环加速值 = this.模拟循环.加速值 || 0
    const 作用分布 = 获取倒读条实际帧数分布(锁神.作用总间隔, 锁神.作用间隔帧, 循环加速值)

    let 已读条时间 = 0
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '锁神读条',
        事件时间: 读条开始时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '锁神',
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    this.模拟循环.添加待生效事件队列?.(待生效事件队列)
    this.模拟循环.锁神触发次数 = 0
  }

  读条结束后() {
    this.模拟循环.锁神触发次数 = (this.模拟循环.锁神触发次数 || 0) + 1
    if (this.模拟循环.锁神触发次数 === 4) {
      this.模拟循环.添加buff?.({ 名称: '读条增伤', 对象: '自身' })
    }
    if ([2, 4].includes(this.模拟循环.锁神触发次数)) {
      this.触发伤害行为('锁神·悟·绝篇', 1)
    }
    this.触发伤害行为('锁神·悟', 1)
    this.技能回复能量(10, '任督')
    this.模拟循环.卸除buff?.({ 名称: '一阳指增伤', 对象: '自身' })
  }

  释放后() {
    this.保存释放记录()
    this.减少绝技技能CD(每秒郭氏帧 * 1)
    this.减少轻功技能CD(每秒郭氏帧 * 1)
    this.对阵招式橙武减少绝技技能CD()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['大橙武增伤', '读条增伤', '截阳无双']),
    }
  }
}

export default 锁神

export const 锁神类型 = typeof 锁神
