import { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '天魔蚀肌',
        奇穴图片: 'https://icon.jx3box.com/icon/3187.png',
        id: '6490',
        奇穴描述: '“蚀肌弹”伤害提高10%。',
      },
      {
        奇穴名称: '毒手尊拳',
        奇穴图片: 'https://icon.jx3box.com/icon/3204.png',
        id: '6491',
        奇穴描述: '“蚀肌弹”会心提高10%，会心效果提高10%。',
      },
      {
        奇穴名称: '血影留痕',
        奇穴图片: 'https://icon.jx3box.com/icon/16217.png',
        id: '28371',
        奇穴描述: '“陷阱技”命中千机弩锁定并攻击的目标后造成一次额外伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '天风汲雨',
        奇穴图片: 'https://icon.jx3box.com/icon/16604.png',
        id: '6493',
        奇穴描述:
          '“天绝地灭”目标数量降低3个，持续时间降低6秒，命中已命中目标后额外触发一次伤害，若该目标为非侠士目标则伤害提高200%。',
      },
      {
        奇穴名称: '暴雨梨花',
        奇穴图片: 'https://icon.jx3box.com/icon/3182.png',
        id: '6443',
        奇穴描述: '“暴雨梨花针”对前方12尺内矩形范围最多6个目标造成伤害。',
      },
      {
        奇穴名称: '千回百转',
        奇穴图片: 'https://icon.jx3box.com/icon/13428.png',
        id: '18237',
        奇穴描述:
          '“孔雀翎”使目标锁足4秒并标记目标，若目标4秒内若受到的伤害超过最大血量的30%，则触发虚弱效果，减速封轻功，基础内外功攻击力和基础治疗效果降低50%，持续5秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '弩击急骤',
        奇穴图片: 'https://icon.jx3box.com/icon/3291.png',
        id: '6495',
        奇穴描述:
          '“连弩”或“重弩”的攻击若会心，获得8秒可叠加时间的“弩心”效果：毒性内功破防等级提高15%。',
      },
      {
        奇穴名称: '弩击轰雷',
        奇穴图片: 'https://icon.jx3box.com/icon/3290.png',
        id: '6498',
        奇穴描述: '重弩的溅射范围增加2尺，累计命中5次，则眩晕目标2秒。',
      },
      {
        奇穴名称: '卸元归魂',
        奇穴图片: 'https://icon.jx3box.com/icon/3181.png',
        id: '18241',
        奇穴描述: '施展“孔雀翎”卸除当前目标的阴性、阳性、毒性、混元气劲各两个。',
      },
      {
        奇穴名称: '绝伦逸群',
        奇穴图片: 'https://icon.jx3box.com/icon/3225.png',
        id: '5719',
        奇穴描述:
          '“浮光掠影”调息时间降低30秒，施展“浮光掠影”获得的“浮光掠影”效果消失后移除移动限制，并使自身免疫移动限制、受到的伤害降低40%，持续4秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '擘两分星',
        奇穴图片: 'https://icon.jx3box.com/icon/11838.png',
        id: '30921',
        奇穴描述:
          '“神机值”低于80点时，造成内功伤害增加20%。“神机值”高于20点时，“陷阱技”造成伤害增加10%。',
      },
      {
        奇穴名称: '千机之威',
        奇穴图片: 'https://icon.jx3box.com/icon/3205.png',
        id: '6506',
        奇穴描述: '当自身位于千机变25尺范围内时，自身基础攻击提高15%。',
      },
      {
        奇穴名称: '千机神速',
        奇穴图片: 'https://icon.jx3box.com/icon/3203.png',
        id: '6507',
        奇穴描述: '当自身位于千机变25尺之内时，自身受到的伤害降低15%且不受到减速效果影响。',
      },
      {
        奇穴名称: '梅花针',
        奇穴图片: 'https://icon.jx3box.com/icon/3174.png',
        id: '3092',
        奇穴描述: '若目标正在运功则进行打断，并使其无法施展内功招式，持续4秒。“浮空”期间不可施展。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '流星赶月',
        奇穴图片: 'https://icon.jx3box.com/icon/3242.png',
        id: '6441',
        奇穴描述:
          '“暴雨梨花针”会心提高10%，会心效果提高10%，“暴雨梨花针”若会心，则回复30点神机值，该效果最多每8秒触发一次。',
      },
      {
        奇穴名称: '天罗地网',
        奇穴图片: 'https://icon.jx3box.com/icon/3241.png',
        id: '40275',
        奇穴描述:
          '被动效果：“暗藏杀机”存在数量提升至3个，调息时间降低3秒，伤害降低30%，招式不再会切换为“图穷匕见”。引爆“暗藏杀机”时击退周围最多3名敌对目标10尺。 &lt;br/&gt;主动效果：引爆全部“暗藏杀机”，获得5层注能。',
      },
      {
        奇穴名称: '确固不拔',
        奇穴图片: 'https://icon.jx3box.com/icon/21975.png',
        id: '37326',
        奇穴描述: '“重弩”命中有2层及以上“激射”效果的目标使其体质降低10%，可叠加4层，持续8秒。',
      },
      {
        奇穴名称: '荆天棘地',
        奇穴图片: 'https://icon.jx3box.com/icon/3198.png',
        id: '3115',
        奇穴描述:
          '消耗15点神机值，对目标发射一个荆棘机关，使其受到点外功伤害或点毒性内功伤害，并使周围最多5个目标目标获得“荆天棘地”效果：外功命中降低100%，内功造成伤害降低100%，持续持续8秒。外功命中降低，内功造成伤害降低效果每秒递减10%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '神机千算',
        奇穴图片: 'https://icon.jx3box.com/icon/3191.png',
        id: '6778',
        奇穴描述: '“毒刹”伤害提高40%且对目标造成伤害后回复自身3%气血最大值，最多每1秒触发一次。',
      },
      {
        奇穴名称: '聚精凝神',
        奇穴图片: 'https://icon.jx3box.com/icon/3231.png',
        id: '6451',
        奇穴描述: '施展“心无旁骛”持续时间增加5秒，并且获得20%急速效果。',
      },
      {
        奇穴名称: '神威穿彻',
        奇穴图片: 'https://icon.jx3box.com/icon/3194.png',
        id: '27267',
        奇穴描述:
          '“鬼斧神工”调息降低40秒，运功时间降低至1.5秒，为千机弩装填15发“鬼斧弹药”，“扬威”持续时间降低至10秒。',
      },
      {
        奇穴名称: '九霄风雷',
        奇穴图片: 'https://icon.jx3box.com/icon/11945.png',
        id: '20544',
        奇穴描述:
          '施展“鬼斧神工”改造自身“千机变”，使自身进入“机甲”状态，可施展特殊招式伤害大幅度提高，机甲状态持续13秒，免疫控制效果。“鬼斧神工”调息时间降低20秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '击搏挽裂',
        奇穴图片: 'https://icon.jx3box.com/icon/3208.png',
        id: '6510',
        奇穴描述: '“蚀肌弹”无需运功可施展，伤害提高70%。变为6秒3层充能招式。',
      },
      {
        奇穴名称: '巧夺天工',
        奇穴图片: 'https://icon.jx3box.com/icon/17181.png',
        id: '30721',
        奇穴描述: '施展“孔雀翎”后标记目标8秒，千机变攻击标记目标时消耗“鬼斧弹药”则返还。',
      },
      {
        奇穴名称: '无声骤雨',
        奇穴图片: 'https://icon.jx3box.com/icon/3186.png',
        id: '6455',
        奇穴描述: '“暴雨梨花针”不再有调息时间。',
      },
      {
        奇穴名称: '化血迷心',
        奇穴图片: 'https://icon.jx3box.com/icon/3188.png',
        id: '18249',
        奇穴描述:
          '“化血”效果伤害提高200%。“蚀肌弹”、“千机变”、“暴雨梨花针”命中带有“化血”效果的目标，有100%几率使“化血”下一跳伤害立即生效。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '雷甲三铉',
        奇穴图片: 'https://icon.jx3box.com/icon/3223.png',
        id: '14857',
        奇穴描述:
          '“鬼斧弹药”期间使连弩、重弩伤害额外提高75%且无视目标50%内功防御，当注能已满时会多获得2发“鬼斧弹药”。',
      },
      {
        奇穴名称: '平地风雷',
        奇穴图片: 'https://icon.jx3box.com/icon/20078.png',
        id: '36279',
        奇穴描述: '“雷震子”会在15尺内敌方目标间弹跳6次，每次控制时间变为2秒。',
      },
      {
        奇穴名称: '林寒涧肃',
        奇穴图片: 'https://icon.jx3box.com/icon/11840.png',
        id: '21961',
        奇穴描述:
          '“天绝地灭”持续效果全部失效，持续时间固定9秒，期间可以被二段招式引爆并造成伤害。将“天绝地灭”周围范围内最多3个敌方目标和自身除“千机变”、“飞星遁影”以外的机关拉扯到“天绝地灭”所在点，并且延长10秒被拉扯机关持续时间。“天绝地灭”初始状态可牵引8尺范围目标，每过1秒拉扯范围增大1尺，最大拉扯范围15尺。',
      },
      {
        奇穴名称: '杀机断魂',
        奇穴图片: 'https://icon.jx3box.com/icon/7440.png',
        id: '33134',
        奇穴描述:
          '每存在一个“天绝地灭”提高10%“千机变”造成的伤害。&lt;br/&gt;每存在一个“暗藏杀机”提高20%“天绝地灭”造成的伤害。&lt;br/&gt;每存在一个“千机变”提高30%“暗藏杀机”造成的伤害。',
      },
      {
        奇穴名称: '鸿爪留泥',
        奇穴图片: 'https://icon.jx3box.com/icon/14133.png',
        id: '29150',
        奇穴描述:
          '“子母飞爪”命中目标玩家后复制目标至多4个增益效果，自身获得相同效果。命中敌方玩家时“子母飞爪”调息时间降低5秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '汇神合极',
        奇穴图片: 'https://icon.jx3box.com/icon/17183.png',
        id: '30722',
        奇穴描述:
          '“子母飞爪”调息时间降低10秒，不再对玩家生效，施展后和自身千机弩链接在一起9秒，进入“汇神合极”状态：填装技不再受到自身与千机弩的距离限制，弹药获得量增加100%。期间可主动施展二段技能“汇神合极”为千机弩填装5发当前已有并且数量最少的弹药。',
      },
      {
        奇穴名称: '秋风散影',
        奇穴图片: 'https://icon.jx3box.com/icon/7438.png',
        id: '6461',
        奇穴描述:
          '当你与当前敌对目标距离超过10尺时，获得8秒“秋风散影”效果：招式会心几率提高10%，会心效果提高10%。',
      },
      {
        奇穴名称: '危峰屹立',
        奇穴图片: 'https://icon.jx3box.com/icon/3197.png',
        id: '6464',
        奇穴描述:
          '“惊鸿游龙”调息时间降低5秒，闪避几率提高至80%，内功伤害降低提高至60%，若躲闪攻击则减少1秒“浮光掠影”调息时间并回复自身3%气血最大值，该效果每1秒最多触发一次。',
      },
      {
        奇穴名称: '袍泽故旧',
        奇穴图片: 'https://icon.jx3box.com/icon/3199.png',
        id: '23642',
        奇穴描述:
          '“子母飞爪”可对友方目标施展。若目标为队友，则自身与目标队友之间生成一条锁链持续7秒。友方目标获得一个增益技能“子母飞爪·子”：解除自身控制效果，并位移至唐门队友身旁；自身可施展二段技能“子母飞爪·子”：解除自身控制效果并位移至队友身旁。施展技能后队友和自身免疫控制（击退和被拉除外），持续2秒，锁链效果作用一次消失。',
      },
      {
        奇穴名称: '千机不殆',
        奇穴图片: 'https://icon.jx3box.com/icon/3230.png',
        id: '6508',
        奇穴描述:
          '“千机变”所有形态伤害提高8%，毒刹对非侠士目标造成伤害提高800%。“鬼斧弹药”持续期间“千机变·重弩”“千机变·连弩”攻击间隔降低0.5秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '回肠荡气',
        奇穴图片: 'https://icon.jx3box.com/icon/3202.png',
        id: '5715',
        奇穴描述: '神机值提高10点。招式会心后有50%几率回复25点神机值，每4秒只能触发一次。',
      },
      {
        奇穴名称: '云合影从',
        奇穴图片: 'https://icon.jx3box.com/icon/20079.png',
        id: '37327',
        奇穴描述:
          '“鬼斧弹药”持续期间“千机变·重弩”命中锁定目标后的爆炸范围提高4尺，并将锁定目标所消耗的“激射”效果转移至其他被命中的目标身上。',
      },
      {
        奇穴名称: '雀引彀中',
        奇穴图片: 'https://icon.jx3box.com/icon/19176.png',
        id: '34679',
        奇穴描述:
          '施展“孔雀翎”后，在目标脚下生成“雀引”机关，并在2秒之后激活，若8尺范围内有敌对目标则对其造成点毒性内功伤害并定身4秒且附带18秒毒性内功持续伤害效果。',
      },
      {
        奇穴名称: '分水逐旌',
        奇穴图片: 'https://icon.jx3box.com/icon/7487.png',
        id: '17572',
        奇穴描述:
          '“惊鸿游龙”状态持续时间内，若自身受到的伤害累积超过自身气血最大值的10%，则自动触发“浮光掠影”隐身效果并卸除自身所有不利效果，持续5秒。',
      },
      {
        奇穴名称: '云奔雨骤',
        奇穴图片: 'https://icon.jx3box.com/icon/12730.png',
        id: '24037',
        奇穴描述:
          '“鸟翔碧空·浮空”或“扬威”期间“蚀肌弹”命中“重弩”“连弩”范围内的目标，则“重弩”或“连弩”将使用特殊子弹进行一次追击，“重弩”造成点毒性内功伤害，“连弩”点毒性内功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '曙色催寒',
        奇穴图片: 'https://icon.jx3box.com/icon/3180.png',
        id: '14856',
        奇穴描述: '招式伤害若会心，则15秒内伤害无视目标25%的内功防御。',
      },
      {
        奇穴名称: '雷骇九天',
        奇穴图片: 'https://icon.jx3box.com/icon/7370.png',
        id: '38750',
        奇穴描述:
          '“鸟翔碧空”浮空期间施展第三段技能，使自身4秒内不受招式控制（击退和被拉除外），且重置“雷震子”调息时间。',
      },
      {
        奇穴名称: '瑕草无霜',
        奇穴图片: 'https://icon.jx3box.com/icon/7444.png',
        id: '14852',
        奇穴描述:
          '施展“浮光掠影”使自身半径20尺内额外最多5名友方玩家目标获得4秒隐身效果，施展任何技能后都解除隐身状态。',
      },
      {
        奇穴名称: '星坠河倾',
        奇穴图片: 'https://icon.jx3box.com/icon/17182.png',
        id: '30724',
        奇穴描述:
          '“激射”效果上限提高10层，施展“孔雀翎”可以把30尺内10个目标的“激射”标记转移至一个目标身上。',
      },
      {
        奇穴名称: '天幕藏锋',
        奇穴图片: 'https://icon.jx3box.com/icon/14134.png',
        id: '33577',
        奇穴描述:
          '“浮空”状态期间可以在空中双击W、S按键中任意一个，快速冲向指定的前方或者后方，获得4秒“扬威”效果，结束“浮空”状态。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '千机连环',
        奇穴图片: 'https://icon.jx3box.com/icon/17184.png',
        id: '30723',
        奇穴描述:
          '瞬间在自身“千机变·连弩”或“千机变·重弩”周围产生2个持续20秒的“千机连弩”，“千机连弩”攻击范围25尺，会和“千机变·连弩”或“千机变·重弩”攻击同样的目标，对其造成点毒性内功伤害，“扬威”效果下或命中非侠士目标后可叠加1层“激射”效果。',
      },
      {
        奇穴名称: '诡鉴冥微',
        奇穴图片: 'https://icon.jx3box.com/icon/18302.png',
        id: '32742',
        奇穴描述:
          '消耗30点神机值，向目标点丢出一个可见不可被摧毁、不可被控制的机关，持续40秒，并重置“陷阱技”调息时间。最多存在两个“诡鉴冥微”。当你施展陷阱技后，“诡鉴冥微”会立即拟态为该次施展的陷阱，拟态“天绝地灭”时，处在任意一个“天绝地灭”内的目标会受到16尺内全部天绝地灭的伤害，所有机关每轮攻击的总伤害次数上限不变。陷阱效果全部生效后，进入10秒的不可拟态的充能时间。',
      },
      {
        奇穴名称: '不负霜雪',
        奇穴图片: 'https://icon.jx3box.com/icon/16215.png',
        id: '28456',
        奇穴描述:
          '填装技，千机变周围四尺施展。瞬间为千机弩装填特殊寒冰子弹6发，连弩或重弩进入3秒的弹药切换状态，停止攻击3秒。之后使连弩或重弩命中目标时消耗一发特殊寒冰子弹，使目标获得“坠凌花”效果：降低15%加速率，持续6秒，可叠加三层。叠满3层“坠凌花”后使目标获得“坠凌花·结”效果：无法施展招式，持续5秒，每秒受到毒性伤害。',
      },
      {
        奇穴名称: '千秋万劫',
        奇穴图片: 'https://icon.jx3box.com/icon/17180.png',
        id: '18675',
        奇穴描述:
          '使自身进入20秒开火状态，最多可使用4次主动技能“千秋万劫”，对目标点范围10尺最多5个目标造成毒性内功伤害，“千秋万劫”对非侠士引爆目标全部“化血”效果，造成伤害提高245%。',
      },
      {
        奇穴名称: '诡面埋伏',
        奇穴图片: 'https://icon.jx3box.com/icon/14135.png',
        id: '25151',
        奇穴描述:
          '陷阱技。消耗30点神机值，在15尺范围内目标点投掷一个1.5秒后激活的干扰弹，持续10秒。敌方进入干扰弹6尺范围或者干扰弹持续时间结束时将被引爆，对6尺范围最多3个目标造成毒性内功伤害，并使之无法运功，无法受到治疗效果，持续3秒。',
      },
    ],
  },
]

export default 奇穴数据
