import { 技能增益列表类型 } from '@/@types/技能'
import 通用增益 from './通用增益/通用增益'
import { 属性类型 } from '@/@types/属性'
import 大橙武技能增益 from './通用增益/大橙武技能增益'

export const 生地狱增益: 技能增益列表类型[] = [
  ...通用增益,
  ...大橙武技能增益,
  {
    增益名称: '寄意',
    增益所在位置: '奇穴',
    依赖奇穴: '寄意',
    增益类型: '全局启用',
    增益集合: [
      { 属性: 属性类型.内功会心百分比, 值: 0.15 },
      { 属性: 属性类型.郭氏内功会心效果等级, 值: 150 },
    ],
  },
  {
    BuffId: 31755,
    增益名称: '连环慢',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.系数增伤, 值: 1.25 }],
  },
  {
    BuffId: 31624,
    增益名称: '傀儡系数增伤',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.系数增伤, 值: 2.2000000000000002 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
  {
    增益名称: '2%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 21 / 1024 }],
  },
  {
    增益名称: '3%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.内功会心百分比, 值: 0.03 }],
  },
  {
    增益名称: '2%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.内功会心百分比, 值: 0.02 }],
  },
]
