import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...(通用循环模拟技能基础数据 as any),
  {
    技能名称: '风流云散',
    技能释放后添加GCD: 0,
    最小GCD: 0,
    造成伤害次数: 0,
    技能CD: 每秒郭氏帧 * 20,
    技能GCD组: '自身',
    技能类型: '轻功',
    图标: 'https://icon.jx3box.com/icon/102299.png',
  },
  {
    技能名称: '一阳指',
    技能释放后添加GCD: 基础GCD帧,
    最小GCD: 0,
    是否为读条技能: true,
    读条时间: 基础GCD帧 * 1,
    造成伤害次数: 1,
    技能CD: 0,
    技能GCD组: '公共',
    技能类型: '傍身',
    图标: 'https://icon.jx3box.com/icon/102280.png',
  },
  {
    技能名称: '引窍',
    技能释放后添加GCD: 基础GCD帧 * 1.5,
    是否为读条技能: true,
    读条时间: 基础GCD帧 * 1.5,
    最小GCD: 0,
    造成伤害次数: 1,
    技能CD: 每秒郭氏帧 * 6,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/102282.png',
  },
  {
    技能名称: '断脉',
    技能释放后添加GCD: 基础GCD帧 * 1,
    最小GCD: 0,
    造成伤害次数: 1,
    技能CD: 每秒郭氏帧 * 5,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/102286.png',
  },
  {
    技能名称: '锁神',
    技能释放后添加GCD: 基础GCD帧 * 2.5,
    是否为读条技能: true,
    读条时间: 基础GCD帧 * 2.5,
    最小GCD: 0,
    造成伤害次数: 4,
    技能CD: 每秒郭氏帧 * 8,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/102283.png',
  },
  {
    技能名称: '截阳',
    技能释放后添加GCD: 基础GCD帧 * 1,
    最小GCD: 0,
    造成伤害次数: 1,
    技能CD: 每秒郭氏帧 * 12,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/102285.png',
  },
  {
    技能名称: '一阳化生',
    技能释放后添加GCD: 基础GCD帧,
    造成伤害次数: 6,
    技能CD: 每秒郭氏帧 * 60,
    技能GCD组: '公共',
    技能类型: '绝技',
    图标: 'https://icon.jx3box.com/icon/102290.png',
  },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    造成伤害次数: 0,
    技能类型: '绝技',
    图标: 'https://icon.jx3box.com/icon/6932.png',
    说明: '插入换行将只以”换行“作为展示换行。 若无"换行"则默认以”风流云散,截阳“作为展示换行.',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
]

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // Buff
  游风: {
    类型: '自身',
    名称: '游风',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/70169.png',
  },
  游风通脉: {
    类型: '自身',
    名称: '游风通脉',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/70169.png',
  },
  悬剑: {
    类型: '目标',
    名称: '悬剑',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 8,
    图标: 'https://icon.jx3box.com/icon/70188.png',
  },
  通脉: {
    类型: '自身',
    名称: '通脉',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/70161.png',
  },
  断脉秘籍: {
    类型: '自身',
    名称: '断脉秘籍',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/102286.png',
  },
  引窍会效: {
    类型: '自身',
    名称: '引窍会效',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/102282.png',
  },
  // 释放截阳后伤害和无双提高10%
  截阳无双: {
    类型: '自身',
    名称: '截阳无双',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/102285.png',
  },
  截阳伤害: {
    类型: '自身',
    名称: '截阳伤害',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/102285.png',
  },
  // 截阳对悬剑目标提高35%伤害
  截阳悬剑: {
    类型: '自身',
    名称: '截阳悬剑',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 1,
    图标: 'https://icon.jx3box.com/icon/70161.png',
  },
  // 引窍对悬剑目标提高15%会心
  引窍悬剑: {
    类型: '自身',
    名称: '引窍悬剑',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 1,
    图标: 'https://icon.jx3box.com/icon/70161.png',
  },
  读条增伤: {
    类型: '自身',
    名称: '读条增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 3,
    图标: 'https://icon.jx3box.com/icon/70161.png',
  },
  一阳指增伤: {
    类型: '自身',
    名称: '一阳指增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 5,
    图标: 'https://icon.jx3box.com/icon/70161.png',
  },
  大招增伤: {
    类型: '自身',
    名称: '大招增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/102290.png',
  },
  大橙武增伤: {
    类型: '自身',
    名称: '大橙武增伤',
    最大层数: 999, // 可以叠加
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/2589.png',
  },
  ...(通用Buff数据 as any),
}
