import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '雾锁',
        奇穴图片: 'https://icon.jx3box.com/icon/1446.png',
        id: '5840',
        奇穴描述: '“四象轮回”的伤害提高10%，减速效果提高20%。',
      },
      {
        奇穴名称: '白虹',
        奇穴图片: 'https://icon.jx3box.com/icon/2936.png',
        id: '5827',
        奇穴描述: '“四象轮回”的会心提高10%，会心效果提高10%。',
      },
      {
        奇穴名称: '不善',
        奇穴图片: 'https://icon.jx3box.com/icon/2937.png',
        id: '17752',
        奇穴描述: '施展“太极无极”使目标移动速度降低40%，持续5秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '霜锋',
        奇穴图片: 'https://icon.jx3box.com/icon/2941.png',
        id: '5828',
        奇穴描述: '运功施展“四象轮回”后下一个“两仪化形”无视目标65%化劲等级。',
      },
      {
        奇穴名称: '心固',
        奇穴图片: 'https://icon.jx3box.com/icon/2023.png',
        id: '5823',
        奇穴描述: '“四象轮回”运功时间减少0.25秒，命中目标时额外获得1.5格气。',
      },
      {
        奇穴名称: '吐故纳新',
        奇穴图片: 'https://icon.jx3box.com/icon/611.png',
        id: '17747',
        奇穴描述:
          '处于自身“生太极”气场当中，自身受到的伤害降低10%，受到攻击有15%几率令攻击者锁足3秒，并回复自身10%的内力，该效果每20秒只能触发一次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '抱一',
        奇穴图片: 'https://icon.jx3box.com/icon/631.png',
        id: '22703',
        奇穴描述: '“坐忘无我”调息时间降低3秒，可额外透支使用一次。',
      },
      {
        奇穴名称: '归衡',
        奇穴图片: 'https://icon.jx3box.com/icon/11324.png',
        id: '33098',
        奇穴描述: '施展“三才化生”会将30尺内自身所有气场收回至自身位置。',
      },
      {
        奇穴名称: '无形',
        奇穴图片: 'https://icon.jx3box.com/icon/4561.png',
        id: '5846',
        奇穴描述: '“两仪化形”命中目标后，对自身前方20尺内路径上最多5个目标造成混元内功伤害。',
      },
      {
        奇穴名称: '化三清',
        奇穴图片: 'https://icon.jx3box.com/icon/1444.png',
        id: '357',
        奇穴描述:
          '产生一个10尺的气场，自身每3秒回复20%内力和1.5格气，小队成员每3秒回复5%内力，持续期间不受打退、打断影响，持续9秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '规焉',
        奇穴图片: 'https://icon.jx3box.com/icon/7492.png',
        id: '14837',
        奇穴描述:
          '受到伤害未重伤状态下自身气血值低于40%，则清除自身“化生势”效果并立刻重置“镇山河”调息时间，该效果最多每2分钟触发一次。',
      },
      {
        奇穴名称: '绝云',
        奇穴图片: 'https://icon.jx3box.com/icon/13385.png',
        id: '30821',
        奇穴描述:
          '“紫气东来”持续期间气点上限提高至8点，“四象轮回”可移动施展，“两仪化形”将根据气点造成更多的伤害及破招伤害。',
      },
      {
        奇穴名称: '抱元',
        奇穴图片: 'https://icon.jx3box.com/icon/2938.png',
        id: '21707',
        奇穴描述: '“六合独尊”范围提高2尺，目标数量提高2个，会心命中一个目标则获得一柄“气剑”。',
      },
      {
        奇穴名称: '八卦洞玄',
        奇穴图片: 'https://icon.jx3box.com/icon/1441.png',
        id: '370',
        奇穴描述:
          '最少半格气对目标造成点混元性内功伤害，最多五格气对目标造成点混元性内功伤害，并使目标不能施展内功招式，持续1秒-5秒。并且命中正在运功的目标能令目标在接下来的5秒内无法使用任何内功招式。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '雨集',
        奇穴图片: 'https://icon.jx3box.com/icon/1439.png',
        id: '5829',
        奇穴描述: '“紫气东来”效果持续期间“四象轮回”无需运功。',
      },
      {
        奇穴名称: '同尘',
        奇穴图片: 'https://icon.jx3box.com/icon/4516.png',
        id: '5819',
        奇穴描述: '“六合独尊”每次造成伤害，均使下一次伤害效果提高35%。',
      },
      {
        奇穴名称: '经首',
        奇穴图片: 'https://icon.jx3box.com/icon/13387.png',
        id: '40824',
        奇穴描述: '成功运功施展“四象轮回”命中侠士目标将减少“紫气东来”4秒调息时间。',
      },
      {
        奇穴名称: '不移',
        奇穴图片: 'https://icon.jx3box.com/icon/2932.png',
        id: '5830',
        奇穴描述: '“凭虚御风”闪避效果额外提高15%，持续时间增加3秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '解牛',
        奇穴图片: 'https://icon.jx3box.com/icon/2929.png',
        id: '5802',
        奇穴描述:
          '对被定身、锁足、眩晕的目标伤害提高25%。每次命中被定身、锁足、眩晕的目标会使自身会心几率提高2%，持续3秒，最多提高20%。',
      },
      {
        奇穴名称: '跬步',
        奇穴图片: 'https://icon.jx3box.com/icon/9533.png',
        id: '18695',
        奇穴描述: '每存在一柄“气剑”，“四象轮回”“两仪化形”伤害提高4%。',
      },
      {
        奇穴名称: '北辰',
        奇穴图片: 'https://icon.jx3box.com/icon/612.png',
        id: '26683',
        奇穴描述: '非战斗状态下“梯云纵”大幅提高抗摔能力，期间可以进行二段跳跃。',
      },
      {
        奇穴名称: '厚亡',
        奇穴图片: 'https://icon.jx3box.com/icon/14082.png',
        id: '24942',
        奇穴描述: '施展“三才化生”产生三角形剑域，延时1秒后对区域内的最多5个目标造成混元内功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '有涯',
        奇穴图片: 'https://icon.jx3box.com/icon/1438.png',
        id: '6798',
        奇穴描述: '“七星拱瑞”成功定身目标后，自身混元内功基础攻击力提高25%，持续5秒。',
      },
      {
        奇穴名称: '雾外江山',
        奇穴图片: 'https://icon.jx3box.com/icon/2931.png',
        id: '6481',
        奇穴描述:
          '除“镇山河”外所有气场招式的调息时间降低1秒，施展气场后额外回复1格气，成功运功施展气场，则使下一个气场无需运功。',
      },
      {
        奇穴名称: '万物',
        奇穴图片: 'https://icon.jx3box.com/icon/2928.png',
        id: '18694',
        奇穴描述:
          '“万世不竭”会心提高10%，会心效果提高10%，“万世不竭·二段”命中气血值低于40%的目标时伤害提高15%。',
      },
      {
        奇穴名称: '正气',
        奇穴图片: 'https://icon.jx3box.com/icon/18284.png',
        id: '32411',
        奇穴描述:
          '“五方行尽”调息时间提高5秒，施展时若目标点存在气场“破苍穹”则会吞噬“破苍穹”气场产生6秒“颠越苍穹”，“颠越苍穹”每秒对8尺内5个敌对目标造成点混元性内功伤害，该伤害命中非侠士目标时额外提高420%，若“颠越苍穹”被自身“五方行尽”“六合独尊”命中则额外触发一次伤害，最多触发5次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '抱阳',
        奇穴图片: 'https://icon.jx3box.com/icon/7422.png',
        id: '14834',
        奇穴描述:
          '“破苍穹”气场持续时间增加12秒，对自身的增益效果提高100%，在该气场范围内施展“紫气东来”则“紫气东来”持续时间提高5秒。',
      },
      {
        奇穴名称: '无我',
        奇穴图片: 'https://icon.jx3box.com/icon/620.png',
        id: '5813',
        奇穴描述:
          '“坐忘无我”调息时间提高50秒，持续时间降低至8秒，化解自身气血最大值50%伤害，每秒恢复自身1%最大气血值，该护盾不受卸除影响。',
      },
      {
        奇穴名称: '羽化',
        奇穴图片: 'https://icon.jx3box.com/icon/11855.png',
        id: '21712',
        奇穴描述:
          '“九转归一”变为2层充能招式，击退中的目标如果碰撞障碍并成功眩晕后则造成点混元性内功伤害。',
      },
      {
        奇穴名称: '若冲',
        奇穴图片: 'https://icon.jx3box.com/icon/16194.png',
        id: '26684',
        奇穴描述: '“太极无极”不再续气，调息时间提高至9秒，每道剑气都将造成混元性内功伤害。',
      },
      {
        奇穴名称: '定迹',
        奇穴图片: 'https://icon.jx3box.com/icon/16195.png',
        id: '34631',
        奇穴描述:
          '施展“五方行尽”2秒后，会在自身施展“五方行尽”的位置造成点混元性内功伤害并定身范围内最多6个目标4秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '归本',
        奇穴图片: 'https://icon.jx3box.com/icon/11855.png',
        id: '34580',
        奇穴描述: "“九转归一”命中被'锁足”“定身”“眩晕”的目标击退距离增加50%。",
      },
      {
        奇穴名称: '浮生',
        奇穴图片: 'https://icon.jx3box.com/icon/9530.png',
        id: '18679',
        奇穴描述:
          '“六合独尊”运功1.5秒之后，在目标点形成“八方剑域”效果，区域内最多6个目标每0.6秒受到混元性内功伤害，并降低80%移动速度，“八方剑域”持续3秒，同时命中多个玩家时则伤害递减，最多递减50%。',
      },
      {
        奇穴名称: '玄通',
        奇穴图片: 'https://icon.jx3box.com/icon/9554.png',
        id: '18798',
        奇穴描述: '“万世不竭”调息时间降低8秒，气剑持续时间增加12秒，招式有效距离增加10尺。',
      },
      {
        奇穴名称: '霜寒',
        奇穴图片: 'https://icon.jx3box.com/icon/4570.png',
        id: '6904',
        奇穴描述: '“镇山河”调息时间降低2分钟，效果只作用于自身，且不再获得“化生势”不利效果。',
      },
      {
        奇穴名称: '大成',
        奇穴图片: 'https://icon.jx3box.com/icon/1440.png',
        id: '24953',
        奇穴描述: '“五方行尽”成功控制目标返还5格气，并使自身“会神”效果提高至40%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '悉归',
        奇穴图片: 'https://icon.jx3box.com/icon/7445.png',
        id: '37387',
        奇穴描述: '“万世不竭·二段”调息时间提高至5秒，施展时不会使气剑提前消失。',
      },
      {
        奇穴名称: '心眼',
        奇穴图片: 'https://icon.jx3box.com/icon/2943.png',
        id: '5844',
        奇穴描述:
          '“镇山河”效果范围提高至6尺，受到无法施展内功招式和缴械效果时也可以施展，自身若处于“镇山河”当中，每秒将恢复自身5%气血最大值。',
      },
      {
        奇穴名称: '星辰',
        奇穴图片: 'https://icon.jx3box.com/icon/18283.png',
        id: '32412',
        奇穴描述:
          '若处于自身“生太极”气场中时施展“凭虚御风”会强化自身位于的“生太极”气场6秒，每秒对最多5个敌方目标造成点混元性内功伤害并恢复自身半格气。',
      },
      {
        奇穴名称: '临风',
        奇穴图片: 'https://icon.jx3box.com/icon/625.png',
        id: '6796',
        奇穴描述: '施展“紫气东来”后，运功不会被打退、打断，不受缴械和无法运功效果的影响，持续6秒。',
      },
      {
        奇穴名称: '破势',
        奇穴图片: 'https://icon.jx3box.com/icon/13384.png',
        id: '24945',
        奇穴描述:
          '“镇山河”调息时间降低2分钟，施展时不再生成气场，而是强化自身当前“气剑”，使“气剑”和“万世不竭·二段”对非侠士目标伤害提高130%，持续3分钟。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '重光',
        奇穴图片: 'https://icon.jx3box.com/icon/4938.png',
        id: '18669',
        奇穴描述: '“万世不竭”每轮攻击频率提高25%。',
      },
      {
        奇穴名称: '凶年',
        奇穴图片: 'https://icon.jx3box.com/icon/7437.png',
        id: '14835',
        奇穴描述: '“生太极”作用范围提高5尺，减速效果提高到45%。',
      },
      {
        奇穴名称: '归元',
        奇穴图片: 'https://icon.jx3box.com/icon/11859.png',
        id: '23614',
        奇穴描述: '“破苍穹”变为无调息时间，只对自己生效，处于“破苍穹”期间自身无视目标60%内功防御。',
      },
      {
        奇穴名称: '自化',
        奇穴图片: 'https://icon.jx3box.com/icon/4552.png',
        id: '14836',
        奇穴描述:
          '“万世不竭”一段“气剑”会随机攻击自身20尺内的目标，每轮命中目标将额外造成一次伤害，命中目标有25%几率锁足目标并为目标添加“气竭”效果，持续5秒。自身任何招式命中带有“气竭”效果的目标将引爆造成6尺范围混元性内功伤害，该效果2秒内对同一目标只生效一次。',
      },
      {
        奇穴名称: '流转',
        奇穴图片: 'https://icon.jx3box.com/icon/18282.png',
        id: '38516',
        奇穴描述:
          '若“破苍穹”生成位置已经有“破苍穹”，则会合成40秒15尺范围“流转·破苍穹”，处于该气场范围内自身“四象轮回”“两仪化形”“万世不竭·二段”会心和会心效果额外提高20%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '非玄',
        奇穴图片: 'https://icon.jx3box.com/icon/7470.png',
        id: '40159',
        奇穴描述:
          '“紫气东来”期间施展“四象轮回”“两仪化形”伤害提高30%，但会额外消耗1秒“紫气东来”持续时间。',
      },
      {
        奇穴名称: '固本',
        奇穴图片: 'https://icon.jx3box.com/icon/7475.png',
        id: '14613',
        奇穴描述:
          '“紫气东来”不再充能和持续获得气点，调息时间降低30秒，施展“紫气东来”后立刻获得5柄“万世不竭·气剑”。',
      },
      {
        奇穴名称: '际地蟠天',
        奇穴图片: 'https://icon.jx3box.com/icon/20069.png',
        id: '36099',
        奇穴描述:
          '“万世不竭·气剑”每次攻击目标积攒2点“炁”，“万世不竭·二段”攻击目标积攒15点“炁”，“炁”超过100点后方可施展该招式，对目标造成混元性内功伤害，若目标血量高于70%，则该招式必定会心。',
      },
      {
        奇穴名称: '剑出鸿蒙',
        奇穴图片: 'https://icon.jx3box.com/icon/17174.png',
        id: '23969',
        奇穴描述:
          '若场上存在自身气场则会在自身气场中心上空产生“鸿蒙古剑”，1秒后“鸿蒙古剑”会坠落至气场之中，对10尺范围内的3个目标造成点混元性内功伤害并眩晕1秒，若目标已经被自身“鸿蒙古剑”命中，则剩余“鸿蒙古剑”伤害降低50%。',
      },
      {
        奇穴名称: '穹隆化生',
        奇穴图片: 'https://icon.jx3box.com/icon/14083.png',
        id: '24955',
        奇穴描述:
          '自身将向前冲刺，持续2秒，可以转向，结束后在脚下生成“生太极”气场，并回复自身10%的最大气血值。',
      },
    ],
  },
]

export default 奇穴数据
