import { 每秒郭氏帧 } from '@/数据/常量'
import { 待生效事件 } from '../../type'
import 技能统一类 from '../../通用类/技能统一类'
import { 获取实际帧数 } from '@/工具函数/data'

/**
 * 经过测试的弱点规
 * 弱点自身原始间隔为24帧
 * 实际应用满足 24-N+1 N为加速档位 既计算加速后额外添加1帧
 * 浮游、物化期间间隔变化远离经过对比JCL得
 * 浮游期间加速间隔激素继续计算，遇到间隔校验是否处于浮游状态，若处于浮游状态则不尽兴弱点，但是会记录弱点记时点
 * 释放物化后，刷新加速快照，按上一次弱点记时点按新间隔生成新的弱点轴
 * 在失去物化后，刷新加速快照，按上一次弱点记时点按新间隔生成新的弱点轴
 */

class 弱点 extends 技能统一类 {
  static 原始间隔 = 16 * 10
  static 最大事件次数 = 500
  static 弱点记时点 = 8

  constructor(模拟循环) {
    super(模拟循环)
    弱点.弱点记时点 = 8

    const 循环加速值 = this.模拟循环?.加速值
    // 用8计算加速。然后*20
    const 加速后帧数 = 获取实际帧数(16, 循环加速值)
    弱点.原始间隔 = 加速后帧数 * 10
  }

  // 获得当前弱点间隔() {
  //   const 弱点实际间隔 = this.模拟循环?.获取物化加速帧数(弱点.原始间隔, this.模拟循环?.加速值) + 1
  //   return 弱点实际间隔
  // }

  初始化弱点() {
    // 立即造成第一次弱点伤害，然后添加序列
    // this.弱点造成伤害()
    弱点.弱点记时点 = 8
    this.刷新弱点序列()
  }

  立即获得并刷新弱点() {
    this.弱点检查()
    this.刷新弱点序列((this.模拟循环?.当前时间 || 0) + 弱点.原始间隔)
  }

  降低寻隙Buff时间(降低帧数 = 0) {
    const 寻隙Buff = this.模拟循环.当前自身buff列表?.['寻隙']
    const 剩余时间 =
      (寻隙Buff?.刷新时间 || 0) + (寻隙Buff?.最大持续时间 || 0) - (this?.模拟循环?.当前时间 || 0)
    if (剩余时间 >= 降低帧数) {
      const 减少后时间 = 剩余时间 - 降低帧数
      const 剩余刷新时间 = (this?.模拟循环?.当前时间 || 0) + 减少后时间
      const 预测刷新时间 = 剩余刷新时间 - (寻隙Buff?.最大持续时间 || 0)
      this.模拟循环.卸除buff?.({ 名称: '寻隙', 对象: '自身' })
      this.模拟循环.添加buff?.({ 名称: '寻隙', 对象: '自身', 事件时间: 预测刷新时间 })
      this.刷新弱点序列(剩余刷新时间)
    } else {
      this.立即获得并刷新弱点()
    }
  }

  刷新弱点序列(初始时间 = 弱点.弱点记时点, 生成次数 = 弱点.最大事件次数) {
    this.模拟循环.删除待生效事件队列?.('弱点检查')
    const 待生效事件: 待生效事件[] = []
    for (let i = 0; i <= 生成次数; i++) {
      const 事件时间 = 初始时间 + 弱点.原始间隔 * i
      待生效事件.push({
        事件名称: `弱点检查`,
        事件时间: 事件时间,
        事件备注: {},
      })
    }
    this.模拟循环.添加待生效事件队列?.(待生效事件)
  }

  弱点检查() {
    弱点.弱点记时点 = this.模拟循环.当前时间 || 0
    this.获得弱点()
  }

  获得弱点() {
    // 判断簇尘
    if (this.模拟循环.校验奇穴是否存在?.('簇尘')) {
      this.模拟循环.添加buff?.({ 名称: '弱点', 对象: '目标' })
      this.模拟循环.添加buff?.({ 名称: '弱点', 对象: '目标' })
    } else {
      // lua就是这么写的
      if (!this.模拟循环.当前目标buff列表?.['弱点']?.当前层数) {
        this.模拟循环.添加buff?.({ 名称: '弱点', 对象: '目标' })
      }
    }

    this.模拟循环.添加buff?.({ 名称: '寻隙', 对象: '自身' })

    // 检查事件是否足够
    this.事件检查()
  }

  事件检查() {
    // 判断当前剩余未生效弱点事件
    const 剩余未生效事件 = this?.模拟循环?.待生效事件队列?.filter(
      (item) => item?.事件名称 === '弱点检查'
    )
    if (剩余未生效事件?.length && 剩余未生效事件?.length < 20) {
      const 最后一个事件时间 = 剩余未生效事件[剩余未生效事件.length - 1]?.事件时间 || 0
      this.刷新弱点序列(最后一个事件时间)
    }
  }

  击破弱点() {
    const 当前破绽层数 = this.模拟循环.当前目标buff列表?.['破绽']?.当前层数 || 0
    if (this.模拟循环.校验奇穴是否存在?.('涣衍') && 当前破绽层数 < 3) {
      this.模拟循环.添加buff?.({ 名称: '破绽', 对象: '目标' })
    }
    this.模拟循环.添加buff?.({ 名称: '破绽', 对象: '目标' })
    this.触发伤害行为('弱点击破')
    this.触发伤害行为('破·击破')

    if (this.模拟循环.校验奇穴是否存在?.('击懈')) {
      if (this.模拟循环.当前自身buff列表?.['灭影追风']?.当前层数) {
        this.降低寻隙Buff时间(每秒郭氏帧 * 5)
      }
    }

    if (this.模拟循环.校验奇穴是否存在?.('戗风')) {
      this.模拟循环.添加buff?.({ 名称: '戗风', 对象: '自身' })
    }

    if (this.模拟循环.校验奇穴是否存在?.('流岚')) {
      if (this.模拟循环.当前目标buff列表?.['流岚击破标记']?.当前层数) {
        this.模拟循环.添加buff?.({ 名称: '流岚', 对象: '自身' })
      }
      this.模拟循环.添加buff?.({ 名称: '流岚击破标记', 对象: '目标' })
    }

    this.模拟循环.卸除buff?.({ 名称: '弱点', 对象: '目标' })
  }
}

export default 弱点

export const 弱点类型 = typeof 弱点
