export default {
  装备基础属性: {
    基础攻击: 54551,
    破防等级: 67178,
    无双等级: 87309,
    会心等级: 55893,
    会心效果等级: 8730,
    全能等级: 0,
    武器伤害_最小值: 7962,
    武器伤害_最大值: 13270,
    破招值: 24555,
    力道: 9710,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 157039,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 0,
    装分: 596301,
  },
  装备镶嵌附魔属性: {
    基础攻击: 12379,
    破防等级: 9002,
    无双等级: 1434,
    会心等级: 10924,
    会心效果等级: 2880,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 960,
    力道: 827,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 0,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104759,
      装备部位: '帽子',
      附魔: '攻击+652',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104790,
      装备部位: '衣服',
      附魔: '无双+717',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104902,
      装备部位: '腰带',
      附魔: '无双+717',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atSurplusValueBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104666,
      装备部位: '护腕',
      附魔: '会心+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104958,
      装备部位: '下装',
      附魔: '会心+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104728,
      装备部位: '鞋子',
      附魔: '攻击+652',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 43059,
      装备部位: '项链',
      附魔: '力道+539',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42989,
      装备部位: '腰坠',
      附魔: '会心+4202',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 43012,
      装备部位: '戒指',
      附魔: '攻击+1142',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 43012,
      装备部位: '戒指',
      附魔: '攻击+1142',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 41219,
      装备部位: '暗器',
      附魔: '破防+4202',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 41273,
      装备部位: '武器',
      附魔: '攻击+652',
    },
  ],
  五彩石: '彩·见切·斩铁·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 1,
    风特效腰坠: 2,
    水特效武器: 2,
  },
}
