import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'

class 跃潮斩波 extends 有CD技能通用类 {
  // lua入口 19818
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '跃潮斩波')

  constructor(模拟循环) {
    super(模拟循环)
  }

  命中() {
    this.跃潮斩波造成伤害()

    // 潮音
    if (this.模拟循环.校验奇穴是否存在('潮音')) {
      this.触发伤害行为('跃潮斩波·潮音', 0.33)
    }

    // 溯徊
    if (this.模拟循环.校验奇穴是否存在('溯徊')) {
      this.跃潮生成驰风震域()
    }

    if (this.模拟循环.当前自身buff列表?.['物化天行']?.当前层数) {
      this.折伞落地()
    }

    this.保存释放记录('跃潮斩波')
  }

  跃潮生成驰风震域() {
    this?.模拟循环?.技能类实例集合?.['驰风震域']?.获得驰风震域()
    this.模拟循环.添加buff?.({ 名称: '溯徊', 对象: '目标' })
    const 待生效事件: 待生效事件[] = []
    待生效事件.push({
      事件名称: `溯徊标记`,
      事件时间: this.模拟循环.当前时间 + 每秒郭氏帧 * 3,
      事件备注: {},
    })
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  溯徊触发() {
    this.触发伤害行为('溯徊', 1, [], undefined, 2)
  }

  跃潮斩波造成伤害() {
    this.触发伤害行为('跃潮斩波')
    this.触发伤害行为('破', 1, [], undefined, 5)
    // 风驰逻辑未做 搜索 32478
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['太息·1', '太息·2', '羽彰', '梦悠']),
    }
  }
}

export default 跃潮斩波

export const 跃潮斩波类型 = typeof 跃潮斩波
