// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 一阳化生 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '一阳化生')

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
  }

  释放后() {
    this.保存释放记录()
    this.模拟循环.添加buff?.({ 名称: '悬剑', 对象: '目标' })
    this.模拟循环.添加buff?.({ 名称: '大招增伤', 对象: '自身' })

    if (this.模拟循环.大橙武模拟) {
      this.模拟循环.添加buff?.({ 名称: '大橙武增伤', 对象: '自身' })
    }

    this.触发伤害行为('一阳化生·悟', 1)
    this.触发伤害行为('一阳化生·悟', 1, ['无界_通用易伤_20·1', '无界_通用内功被会心_20·1'])
    this.触发伤害行为('一阳化生·悟', 1, ['无界_通用易伤_40·1', '无界_通用内功被会心_40·1'])
    this.触发伤害行为('一阳化生·悟', 1, ['无界_通用易伤_60·1', '无界_通用内功被会心_60·1'])
    this.触发伤害行为('一阳化生·悟', 1, ['无界_通用易伤_80·1', '无界_通用内功被会心_80·1'])
    this.触发伤害行为('一阳化生·悟', 1, ['无界_通用易伤_100·1', '无界_通用内功被会心_100·1'])
  }

  保存释放记录() {
    const 造成buff数据 = this.获取施加重要buff信息('大橙武增伤')
    this.本次释放记录 = {
      造成buff数据: 造成buff数据 ? 造成buff数据 : undefined,
      重要buff列表: this.获取当前重要buff列表(['游风', '游风通脉', '大橙武增伤']),
    }
  }
}

export default 一阳化生

export const 一阳化生类型 = typeof 一阳化生
