// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 留客雨 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '留客雨')

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
  }

  造成伤害() {
    const 当前流血层数 =
      this.模拟循环?.技能类实例集合?.流血?.DOT运行数据?.待生效数据?.[0]?.当前层数 || 0
    const buff列表: string[] = []
    if (当前流血层数 > 0) {
      buff列表.push('流血增伤')
    }
    this.触发伤害行为('留客雨·悟', 1, buff列表)

    // 倒海悟命中流血额外添加一层
    if (当前流血层数) {
      this.模拟循环.技能类实例集合?.流血?.获得和刷新流血?.()
    }
  }

  释放后() {
    this.释放技能回复锐意(30, '留客雨·悟')
    this.减少GCD()
    this.保存释放记录()
    this.减少绝技技能CD(16)
    this.对阵招式橙武减少绝技技能CD()
  }

  减少GCD() {
    if (this.模拟循环?.GCD组?.公共) {
      // 这里给没有GCD的技能添加1帧的按键延迟，因为人的手速没有那么快
      this.模拟循环.GCD组.公共 = 0
      this.模拟循环.添加战斗日志?.({
        日志: `留客雨命中减重置GCD`,
        日志类型: '技能释放结果',
      })
    }
    if (this.模拟循环?.GCD组?.傍身) {
      // 这里给没有GCD的技能添加1帧的按键延迟，因为人的手速没有那么快
      this.模拟循环.GCD组.傍身 = 0
      this.模拟循环.添加战斗日志?.({
        日志: `留客雨命中减重置GCD`,
        日志类型: '技能释放结果',
      })
    }
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['灭影追风·悟', '披靡·悟', '横云一式', '大橙武增伤']),
    }
  }
}

export default 留客雨

export const 留客雨类型 = typeof 留客雨
