import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 雾刃飞光 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '雾刃飞光')

  constructor(模拟循环) {
    super(模拟循环)
    雾刃飞光.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '雾刃飞光')
    this.初始化技能运行数据()
  }

  释放() {
    if ((this.模拟循环.当前时间 - this.模拟循环.上次雾刃飞光释放时间) > (雾刃飞光.技能数据?.技能CD || 0)) {
      this.模拟循环.雾刃飞光段数 = 1
    }
    if (this.模拟循环.雾刃飞光段数 === 1) {
      const 充能时间点 = this.技能运行数据.待充能时间点[0] || 0
      if (this.模拟循环.当前时间 < 充能时间点) {
        return {
          可以释放: false,
          异常信息: {
            信息: '雾刃飞光调息中'
          }
        }
      } else {
        const 本次释放充能 = this.模拟循环.当前时间 + (雾刃飞光.技能数据?.技能CD || 0)
        const 新待充能时间点 = [本次释放充能]
        this.更新技能运行数据({
          待充能时间点: 新待充能时间点,
        })
      }
    } else {
      const 间隔时间 = this.模拟循环.当前时间 - this.模拟循环.上次雾刃飞光释放时间
      if (间隔时间 > 每秒郭氏帧 * 4) {
        return {
          可以释放: false,
          异常信息: {
            信息: '雾刃飞光需在4秒内打出'
          }
        }
      }
    }
    return
  }

  技能释放前检查运行数据() {

  }

  命中() {
    const 滃从奇穴 = this.模拟循环.校验奇穴是否存在?.('滃从')
    const 雾刃飞光数组 = 滃从奇穴 ?
      ['雾刃飞光·雾', '雾刃飞光·刃·滃从', '雾刃飞光·飞·滃从', '雾刃飞光·光·滃从'] :
      ['雾刃飞光·雾', '雾刃飞光·刃', '雾刃飞光·飞', '雾刃飞光·光']
    this.模拟循环.技能造成伤害(雾刃飞光数组[this.模拟循环.雾刃飞光段数 - 1], 1)
    if (this.模拟循环.校验奇穴是否存在?.('启霁')) {
      this.模拟循环.技能类实例集合?.骤风令?.减少调息时间?.(每秒郭氏帧 * 1)
    }
    if (this.模拟循环.校验奇穴是否存在?.('滃从') && this.模拟循环.雾刃飞光段数 === 4) {
      this.模拟循环.添加buff({ 名称: '滃从', 对象: '自身' })
    }
    this.模拟循环.雾刃飞光段数 = this.模拟循环.雾刃飞光段数 % 4 + 1
    this.模拟循环.上次雾刃飞光释放时间 = this.模拟循环.当前时间
  }

  获取释放后GCD减少时间() {
    return 9
  }

  技能释放后更新运行数据() {

  }

  保存释放记录(段数) {
    this.本次释放记录 = {
      伤害段数: 段数,
      重要buff列表: this.获取当前重要buff列表(['出岫']),
    }
  }
}

export default 雾刃飞光

export const 雾刃飞光类型 = typeof 雾刃飞光
