export default {
  装备基础属性: {
    基础攻击: 51608,
    破防等级: 57041,
    无双等级: 88357,
    会心等级: 109793,
    会心效果等级: 28174,
    全能等级: 0,
    武器伤害_最小值: 7026,
    武器伤害_最大值: 11710,
    破招值: 960,
    力道: 7266,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 156892,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 2401,
    装分: 595818,
  },
  装备镶嵌附魔属性: {
    基础攻击: 8402,
    破防等级: 5760,
    无双等级: 9116,
    会心等级: 13708,
    会心效果等级: 2880,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 960,
    力道: 2322,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 2401,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 105062,
      装备部位: '帽子',
      附魔: '攻击+652',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104803,
      装备部位: '衣服',
      附魔: '无双+717',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSurplusValueBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104909,
      装备部位: '腰带',
      附魔: '无双+717',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104935,
      装备部位: '护腕',
      附魔: '无双+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104963,
      装备部位: '下装',
      附魔: '无双+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 104741,
      装备部位: '鞋子',
      附魔: '加速+2401',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 43114,
      装备部位: '项链',
      附魔: '力道+539',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42989,
      装备部位: '腰坠',
      附魔: '会心+4202',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 43016,
      装备部位: '戒指',
      附魔: '力道+539',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 43016,
      装备部位: '戒指',
      附魔: '力道+539',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 41338,
      装备部位: '暗器',
      附魔: '力道+539',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 41286,
      装备部位: '武器',
      附魔: '攻击+652',
    },
  ],
  五彩石: '彩·锐刃·无双·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    试炼适应之力: 4,
    常驻套装会心会效: 1,
    套装技能: 0,
    特效_2870: 1,
    特效_2869: 1,
    特效_2872: 1,
    试炼项链会心: 4,
    风特效腰坠: 2,
    特效_2875: 2,
    试炼暗器特效: 4,
    水特效武器: 2,
  },
}
