export default {
  装备基础属性: {
    基础攻击: 51315,
    破防等级: 84460,
    无双等级: 107360,
    会心等级: 85066,
    会心效果等级: 19046,
    全能等级: 0,
    武器伤害_最小值: 9360,
    武器伤害_最大值: 14835,
    破招值: 0,
    力道: 11393,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 183380,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 34012,
    装分: 690685,
  },
  装备镶嵌附魔属性: {
    基础攻击: 7838,
    破防等级: 10512,
    无双等级: 11762,
    会心等级: 14570,
    会心效果等级: 1122,
    全能等级: 0,
    武器伤害_最小值: 1148,
    武器伤害_最大值: 1148,
    破招值: 0,
    力道: 2214,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 5602,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106891,
      装备部位: '帽子',
      附魔: '加速+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106825,
      装备部位: '衣服',
      附魔: '无双+836',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106931,
      装备部位: '腰带',
      附魔: '无双+836',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106958,
      装备部位: '护腕',
      附魔: '无双+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106987,
      装备部位: '下装',
      附魔: '无双+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106761,
      装备部位: '鞋子',
      附魔: '加速+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 44325,
      装备部位: '项链',
      附魔: '力道+628',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 44337,
      装备部位: '腰坠',
      附魔: '会心+4902',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 44364,
      装备部位: '戒指',
      附魔: '力道+628',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 44364,
      装备部位: '戒指',
      附魔: '力道+628',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42628,
      装备部位: '暗器',
      附魔: '破防+4902',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42737,
      装备部位: '武器',
      附魔: '武伤+1148',
    },
  ],
  五彩石: '彩·见切·斩铁·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 0,
    特效_40790: 2,
    特效_40788: 2,
    特效_40793: 2,
    风特效腰坠: 2,
    特效_40803: 2,
    水特效武器: 2,
  },
}
