import { 循环数据 } from '@/@types/循环'

const 起手爆发: Partial<循环数据> = {
  名称: '起手爆发',
  标题: '起手爆发',
  类型: '自定义',
  标记: '自定义',
  奇穴: [
    "无诤",
    "挂碍",
    "三生",
    "金刚怒目",
    "众嗔",
    "无执",
    "金刚日轮",
    "降魔渡厄",
    "我闻",
    "布泽"
  ],
  秘籍: {
    "捕风式": [
      "15%伤害",
      "10%伤害_1",
      "10%伤害_2",
      "减CD_0.5_1"
    ],
    "普渡四方": [
      "4%伤害",
      "5%伤害",
      "减CD_0.25_2",
      "减CD_0.25_1"
    ],
    "横扫六合": [
      "50%伤害",
      "加时间_6"
    ],
    "拿云式": [
      "5%伤害",
      "4%伤害",
      "3%伤害",
      "命中回豆"
    ],
    "守缺式": [
      "5%伤害",
      "4%会心",
      "4%伤害",
      "3%伤害"
    ],
    "韦陀献杵": [
      "3%伤害",
      "4%伤害",
      "5%伤害",
      "命中回豆"
    ],
    "擒龙决": [
      "加时间_1_1",
      "不再恢复禅那",
      "加时间_1_2",
      "加时间_1_3"
    ]
  },
  技能序列: [
    '罗汉金身', '擒龙决', '横扫六合', '守缺式', '拿云式', '守缺式', '拿云式', '守缺式', '拿云式', '守缺式', '拿云式', '守缺式', '韦陀献杵',
  ],
}

export default 起手爆发
