import type { 技能基础数据模型 } from '@/@types/技能'

import { 获取破招实际系数 } from '../../统一数据/系数计算'

import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'

import 通用增益 from './技能增益/通用增益/通用增益'
import 千机变增益 from './技能增益/千机变'
import 千机变无特殊子弹增益 from './技能增益/千机变无特殊子弹'

import 天绝地灭增益 from './技能增益/天绝地灭'
import 暴雨梨花针增益 from './技能增益/暴雨梨花针'
import 暗藏杀机增益 from './技能增益/暗藏杀机'
import 罡风镖法增益 from './技能增益/罡风镖法'
import 蚀肌弹增益 from './技能增益/蚀肌弹'
import 千秋万劫增益 from './技能增益/千秋万劫'
import 毒刹增益 from './技能增益/毒刹'

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '32885',
    技能名称: '破',
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(-660449.7879040001),
    技能增益列表: 通用增益,
  },
  {
    技能ID: '3121',
    技能名称: '罡风镖法',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 罡风镖法增益,
  },
  {
    技能ID: '3105',
    技能名称: '蚀肌弹',
    统计名称: '蚀肌弹',
    秘籍依赖技能: '蚀肌弹',
    技能伤害系数: 361.97264235132025 + 28 - 4,
    基础伤害_基础值: 180,
    基础伤害_浮动值: 20,
    武器伤害系数: 1,
    技能增益列表: 蚀肌弹增益,
  },
  {
    技能ID: '3221_3126', // 3221_3126
    技能名称: '化血(DOT)',
    统计名称: '化血(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 8,
    基础伤害_基础值: 100,
    技能伤害系数: 346.84650000000005,
    技能增益列表: 通用增益,
  },
  // {
  //   技能ID: '3221_21266', // 3221_21266
  //   技能名称: '化血(DOT)·化血迷心',
  //   统计名称: '化血(DOT)',
  //   DOT生效间隔: 48,
  //   DOT跳数: 8,
  //   基础伤害_基础值: 100,
  //   技能伤害系数: 630.63,
  //   技能增益列表: 通用增益,
  // },
  {
    技能ID: '14611_21266',
    技能名称: '化血(DOT)·化血迷心',
    统计名称: '化血(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 8,
    基础伤害_基础值: 100,
    技能伤害系数: 1040.5395,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '14611_21266_29687',
    技能名称: '化血(DOT)·化血迷心·引爆',
    统计名称: '化血(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 8,
    基础伤害_基础值: 100,
    技能伤害系数: 1040.5395,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '29549_38760', // 29549_38760
    技能名称: '雀引(DOT)',
    统计名称: '雀引(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 6,
    基础伤害_基础值: 180,
    技能伤害系数: 822.0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '38760',
    技能名称: '雀引彀中',
    技能伤害系数: 300,
    基础伤害_基础值: 18,
    基础伤害_浮动值: 9,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '3223',
    技能名称: '孔雀翎',
    技能伤害系数: 130,
    基础伤害_基础值: 347,
    基础伤害_浮动值: 36,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '3228',
    技能名称: '暴雨梨花针',
    统计名称: '暴雨梨花针',
    秘籍依赖技能: '暴雨梨花针',
    技能伤害系数: 95.12074687500004,
    基础伤害_基础值: 523,
    基础伤害_浮动值: 52,
    技能增益列表: 暴雨梨花针增益,
  },
  {
    技能ID: '3480',
    技能名称: '暴雨梨花针·额外',
    统计名称: '暴雨梨花针',
    秘籍依赖技能: '暴雨梨花针',
    技能伤害系数: 411.59999999999997,
    基础伤害_基础值: 621,
    基础伤害_浮动值: 65,
    技能增益列表: 暴雨梨花针增益,
  },
  {
    技能ID: '3313',
    技能名称: '图穷匕见',
    秘籍依赖技能: '暗藏杀机',
    技能伤害系数: 698.0014470000002,
    基础伤害_浮动值: 210,
    技能增益列表: 暗藏杀机增益,
  },
  {
    技能ID: '3393',
    技能名称: '天女散花',
    技能伤害系数: 172.5,
    基础伤害_基础值: 124,
    基础伤害_浮动值: 13,
    技能增益列表: 通用增益,
  },

  {
    技能ID: '3367',
    技能名称: '毒刹',
    统计名称: '毒刹',
    技能伤害系数: 135.13500000000002,
    基础伤害_基础值: 57,
    基础伤害_浮动值: 7,
    技能增益列表: 毒刹增益,
  },
  {
    技能ID: '3401',
    技能名称: '连弩·一',
    统计名称: '连弩',
    技能伤害系数: 166.40523900000005,
    基础伤害_基础值: 48,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变增益,
  },
  {
    技能ID: '3404',
    技能名称: '连弩·二',
    统计名称: '连弩',
    // 技能伤害系数: 226.02139560000003,
    技能伤害系数: 144 * 1.1 * 1.15 * 0.9 * 1.05 * (1 + 1 / 100) * 1.3,
    基础伤害_基础值: 50,
    基础伤害_浮动值: 10,
    技能增益列表: 千机变增益,
    技能等级数据: {
      '1,32': {
        技能伤害系数: (i) => 144 * 1.1 * 1.15 * 0.9 * 1.05 * (1 + i / 100) * 1.3,
        基础伤害_基础值: [
          50, 51, 51, 52, 52, 53, 53, 54, 54, 55, 55, 56, 56, 57, 57, 57, 58, 59, 59, 60, 60, 61,
          61, 62, 62, 63, 63, 64, 64, 65, 65,
        ],
        基础伤害_浮动值: [
          10, 10, 10, 10, 10, 10, 10, 10, 10, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 12, 12, 12,
          12, 12, 12, 12, 12, 12, 12, 13, 13,
        ],
      },
    },
  },
  {
    技能ID: '3819',
    技能名称: '重弩·一',
    统计名称: '重弩',
    技能伤害系数: 165.0403755,
    基础伤害_基础值: 53,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变增益,
    技能等级数据: {
      1: { 技能伤害系数: 165.0403755, 基础伤害_基础值: 53, 基础伤害_浮动值: 6 },
      2: {
        技能伤害系数: 412.60093875,
        基础伤害_基础值: 133,
        基础伤害_浮动值: 17,
      },
      3: { 技能伤害系数: 330.080751, 基础伤害_基础值: 53, 基础伤害_浮动值: 6 },
    },
  },
  {
    技能ID: '3824',
    技能名称: '重弩·二',
    统计名称: '重弩',
    技能伤害系数: 295.9537581,
    基础伤害_基础值: 79,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变增益,
    技能等级数据: {
      1: { 技能伤害系数: 295.9537581, 基础伤害_基础值: 79, 基础伤害_浮动值: 6 },
      2: {
        技能伤害系数: 739.8843952500001,
        基础伤害_基础值: 198,
        基础伤害_浮动值: 17,
      },
      3: { 技能伤害系数: 591.9075162, 基础伤害_基础值: 79, 基础伤害_浮动值: 6 },
    },
  },
  {
    技能ID: '18677',
    技能名称: '千秋万劫',
    技能伤害系数: 988.5549960000003,
    基础伤害_基础值: 40,
    基础伤害_浮动值: 40,
    技能增益列表: 千秋万劫增益,
  },
  {
    技能ID: '28441',
    技能名称: '千秋万劫·飞天',
    技能伤害系数: 988.5549960000003,
    基础伤害_基础值: 40,
    基础伤害_浮动值: 40,
    技能增益列表: 千秋万劫增益,
  },
  {
    技能ID: '18776',
    技能名称: '蚀肌弹·飞天',
    统计名称: '蚀肌弹',
    秘籍依赖技能: '蚀肌弹',
    技能伤害系数: 230.1161108400001 + 28 - 4,
    基础伤害_基础值: 180,
    基础伤害_浮动值: 20,
    武器伤害系数: 1,
    技能增益列表: 蚀肌弹增益,
  },
  {
    技能ID: '25774',
    技能名称: '蚀肌弹·神兵',
    技能伤害系数: 40,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '30894',
    技能名称: '血影留痕',
    技能伤害系数: 121.6512,
    基础伤害_基础值: 18,
    基础伤害_浮动值: 9,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '31026',
    技能名称: '千机连环·一',
    统计名称: '千机连环',
    技能伤害系数: 154.92708,
    基础伤害_基础值: 50,
    基础伤害_浮动值: 10,
    技能增益列表: 千机变无特殊子弹增益,
  },
  {
    技能ID: '31027',
    技能名称: '千机连环·二',
    统计名称: '千机连环',
    技能伤害系数: 87.94170000000001,
    基础伤害_基础值: 37,
    基础伤害_浮动值: 5,
    技能增益列表: 千机变无特殊子弹增益,
  },
  {
    技能ID: '26900',
    技能名称: '雨骤',
    技能伤害系数: 267.37935174719996,
    基础伤害_基础值: 37,
    基础伤害_浮动值: 5,
    技能增益列表: 千机变无特殊子弹增益,
  },
  {
    技能ID: '26901',
    技能名称: '云奔',
    技能伤害系数: 347.39404498814395,
    基础伤害_基础值: 53,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变无特殊子弹增益,
  },
  {
    技能ID: '36502',
    技能名称: '天绝地灭',
    秘籍依赖技能: '天绝地灭',
    技能伤害系数: 70.4,
    基础伤害_基础值: 104,
    基础伤害_浮动值: 52,
    技能增益列表: 天绝地灭增益,
  },
  {
    技能ID: '30727',
    技能名称: '天风汲雨',
    秘籍依赖技能: '天绝地灭',
    技能伤害系数: 327.36000000000007,
    基础伤害_基础值: 104,
    基础伤害_浮动值: 52,
    技能增益列表: 天绝地灭增益,
  },
  // --------------
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
}

export { 技能增益 }
