import 技能统一类 from '../../通用类/技能统一类'
import { 待生效事件 } from '../../type'
import { 每秒郭氏帧 } from '@/数据/常量'

class 驰风震域 extends 技能统一类 {
  constructor(模拟循环) {
    super(模拟循环)
  }

  获得驰风震域() {
    const 驰风震域数据: any = this.模拟循环.Buff和Dot数据?.['驰风震域']
    const 驰风震域频率 = 驰风震域数据?.伤害频率 || 4
    const 事件次数 = 驰风震域数据?.最大作用次数 || 24
    // 跃本身伤害吃不到梦悠
    if (this.模拟循环.校验奇穴是否存在('梦悠')) {
      this.模拟循环.添加buff?.({ 名称: '梦悠', 对象: '自身' })
    }

    this.风驰校验()

    this.模拟循环.添加buff?.({ 名称: '驰风震域', 对象: '目标' })

    this.添加驰风震域检测队列(事件次数, 驰风震域频率)
  }

  获得驰风震域海碧() {
    const 驰风震域海碧数据: any = this.模拟循环.Buff和Dot数据?.['驰风震域·海碧']
    const 驰风震域海碧频率 = 驰风震域海碧数据?.伤害频率 || 4
    const 事件次数 = 驰风震域海碧数据?.最大作用次数 || 24
    // 跃本身伤害吃不到梦悠
    if (this.模拟循环.校验奇穴是否存在('梦悠')) {
      this.模拟循环.添加buff?.({ 名称: '梦悠', 对象: '自身' })
    }

    this.风驰校验()

    this.模拟循环.添加buff?.({ 名称: '驰风震域·海碧', 对象: '目标' })

    this.添加驰风震域检测队列(事件次数, 驰风震域海碧频率)
  }

  风驰校验() {
    if (this.模拟循环.校验奇穴是否存在('风驰')) {
      if (this?.模拟循环?.角色状态信息?.体态 === '落地') {
        this?.模拟循环?.技能类实例集合?.['海运南冥']?.减少调息时间(每秒郭氏帧 * 2)
        this?.模拟循环?.技能类实例集合?.['溟海御波']?.减少调息时间(每秒郭氏帧 * 2)
        this?.模拟循环?.技能类实例集合?.['逐波灵游']?.减少调息时间(每秒郭氏帧 * 2)
      }
      const 驰风震域存续校验 =
        this?.模拟循环?.当前目标buff列表?.['驰风震域']?.当前层数 ||
        this?.模拟循环?.当前目标buff列表?.['驰风震域·海碧']?.当前层数

      if (驰风震域存续校验) {
        this.模拟循环.卸除buff?.({ 名称: '驰风震域', 对象: '目标' })
        this.模拟循环.卸除buff?.({ 名称: '驰风震域·海碧', 对象: '目标' })
        this.模拟循环?.删除待生效事件队列('驰风震域检测')
        this.触发伤害行为('风驰')
      }
    }
  }

  添加驰风震域检测队列(事件次数, 频率) {
    const 待生效事件: 待生效事件[] = []
    for (let i = 1; i <= 事件次数; i++) {
      const 事件时间 = this.模拟循环.当前时间 + 频率 * i
      待生效事件.push({
        事件名称: `驰风震域检测·${i + 1}`,
        事件时间: 事件时间,
        事件备注: {},
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  驰风震域触发() {
    // 跃本身伤害吃不到梦悠
    if (this.模拟循环.校验奇穴是否存在('梦悠') && this.驰风震域存续判定()) {
      this.模拟循环.添加buff?.({ 名称: '梦悠', 对象: '自身' })
    }
  }
}

export default 驰风震域

export const 驰风震域类型 = typeof 驰风震域
