import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 振翅图南 extends 有CD技能通用类 {
  // lua入口 20259
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '振翅图南')

  constructor(模拟循环) {
    super(模拟循环)
    振翅图南.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '振翅图南')
    this.初始化技能运行数据()
  }

  重置调息时间() {
    this.更新技能运行数据({ 待充能时间点: [] })
  }

  命中() {
    this.添加振翅图南事件()
    // 驰行
    if (this.模拟循环.校验奇穴是否存在('驰行')) {
      this.模拟循环.添加buff?.({ 名称: '驰行', 对象: '自身' })
    }
    this.保存释放记录()
  }

  添加振翅图南事件() {
    this.模拟循环.添加buff?.({ 名称: '振翅图南', 对象: '目标' })
    const 振翅图南数据: any = this.模拟循环.Buff和Dot数据?.['振翅图南']
    const 振翅图南次数 = 振翅图南数据?.最大作用次数 || 12
    const 振翅图南间隔 = 振翅图南数据?.伤害频率 || 8
    const 待生效事件: 待生效事件[] = []
    for (let i = 1; i <= 振翅图南次数; i++) {
      const 事件时间 = this.模拟循环.当前时间 + 振翅图南间隔 * i
      待生效事件.push({
        事件名称: `振翅图南·${i + 1}`,
        事件时间: 事件时间,
        事件备注: {},
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  振翅图南触发() {
    this.振翅图南造成伤害()
  }

  振翅图南造成伤害() {
    this.触发伤害行为('振翅图南')
  }

  保存释放记录() {
    if (this.模拟循环.校验奇穴是否存在('驰行')) {
      const 造成buff数据 = this.获取施加重要buff信息('驰行')
      this.本次释放记录 = 造成buff数据 ? { 造成buff数据 } : {}
    }
  }
}

export default 振翅图南

export const 振翅图南类型 = typeof 振翅图南
