// import 循环主类 from '../main'
// import { 每秒郭氏帧 } from '@/数据/常量'
import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 获取实际帧数 } from '@/工具函数/data'
import { 待生效事件 } from '../../type'

class 引窍 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '引窍')

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
  }

  获取读条时间() {
    return 获取实际帧数(引窍.技能数据?.读条时间, this.模拟循环.加速值)
  }

  读条(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    const 读条帧数 = this.获取读条时间()

    待生效事件队列.push({
      事件名称: '引窍读条',
      事件时间: 读条开始时间 + 读条帧数,
      事件备注: {
        技能名称: '引窍',
      },
    })
    this.模拟循环.添加待生效事件队列?.(待生效事件队列)
    const 通脉层数 = this.模拟循环.当前自身buff列表?.通脉?.当前层数 || 0
    let 造成buff数据: any = undefined
    if (通脉层数 === 2) {
        造成buff数据 = this.获取施加重要buff信息('游风通脉')
    }
    this.本次释放记录 = {
      造成buff数据: 造成buff数据 ? 造成buff数据 : undefined,
      重要buff列表: this.获取当前重要buff列表(['游风', '游风通脉']),
    }
  }

  读条结束后() {
    const 通脉层数 = this.模拟循环.当前自身buff列表?.通脉?.当前层数 || 0
    // 通脉3层不刷新,必须消失后重新叠
    if (通脉层数 < 3) {
      this.模拟循环.添加buff?.({ 名称: '通脉', 对象: '自身' })
      if (通脉层数 === 2) {
        this.模拟循环.添加buff?.({ 名称: '游风通脉', 对象: '自身' })
      }
    }

    this.模拟循环.添加buff?.({ 名称: '引窍会效', 对象: '自身' })
    this.模拟循环.添加buff?.({ 名称: '读条增伤', 对象: '自身' })
    // 游风状态下减CD
    const 自身有游风 = !!this.模拟循环.当前自身buff列表?.游风?.当前层数 || this.模拟循环.当前自身buff列表?.游风通脉?.当前层数
    const 是否减少引窍CD = this.模拟循环.当前自身buff列表?.通脉?.当前层数 === 3 || 自身有游风
    this.更新技能运行数据({
      待充能时间点: [
        (this.模拟循环.当前时间 || 0) +
          (引窍.技能数据?.技能CD || 0) -
          (是否减少引窍CD ? 每秒郭氏帧 * 3 : 0),
      ],
    })
    const 目标有悬剑 = !!this.模拟循环.当前目标buff列表?.悬剑?.当前层数
    if (目标有悬剑) {
      this.触发伤害行为('引窍·悟', 1, ['引窍悬剑'])
      if (自身有游风) {
        this.触发伤害行为('风扬·悟', 1)
      }
    } else {
      this.触发伤害行为('引窍·悟', 1)
    }
    this.模拟循环.卸除buff?.({ 名称: '一阳指增伤', 对象: '自身' })
    this.减少绝技技能CD(每秒郭氏帧 * 1)
    this.减少轻功技能CD(每秒郭氏帧 * 1)
    this.对阵招式橙武减少绝技技能CD()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['游风', '游风通脉', '大橙武增伤']),
    }
  }
}

export default 引窍

export const 引窍类型 = typeof 引窍
