import { 五彩石数据类型 } from '@/@types/五彩石'
import { 属性类型 } from '@/@types/属性'
import { 五彩石增益类型枚举 } from '@/@types/枚举'

const 五彩石_五级: 五彩石数据类型[] = [
  {
    五彩石名称: '彩·见切·痛击·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·痛击·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·鹤顶·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·鹤顶·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·鹤顶·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·鹤顶·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·腐心·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·腐心·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·腐心·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·腐心·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·破招·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·破招·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·无双·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·无双·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·鹤顶·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·鹤顶·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·鹤顶·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·腐心·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·痛击·腐心·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·腐心·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·见切·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·痛击·见切·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·破招·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·痛击·破招·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·无双·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·痛击·无双·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·破招·痛击·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·痛击·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·破招·鹤顶·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·破招·鹤顶·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·腐心·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·腐心·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·激流·灭气(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·破招·灭气·激流(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·见切·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·见切·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·破招·急速·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·痛击·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·痛击·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·无双·鹤顶·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·无双·鹤顶·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·激流·灭气(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·无双·腐心·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·腐心·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·灭气·激流(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·见切·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·见切·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·无双·急速·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·鹤顶·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·真元·鹤顶·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·激流·灭气(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·真元·腐心·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·腐心·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·灭气·激流(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·见切·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·见切·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·真元·见切·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·痛击·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·痛击·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·真元·急速·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 156 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·腐心·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·腐心·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·腐心·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·见切·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·见切·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·见切·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·见切·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·痛击·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·痛击·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·痛击·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·破招·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·破招·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·破招·见切(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·破招·急速(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·急速·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·急速·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·无双·腐心(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·无双·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·无双·见切(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·鹤顶·无双·急速(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·激流·灭气·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·激流·灭气·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·激流·破招·灭气(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·激流·无双·灭气(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 368 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·鹤顶·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·鹤顶·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·鹤顶·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·见切·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·见切·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·见切·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·见切·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·痛击·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·痛击·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·痛击·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·破招·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·破招·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·破招·见切(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·腐心·无双·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·无双·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·腐心·无双·见切(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·灭气·激流·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·灭气·激流·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·灭气·破招·激流(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·无双·激流(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·击破·强击·聚魂(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.全会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 2438 },
      { 增益类型: 属性类型.郭氏元气, 增益名称: 五彩石增益类型枚举.元气百分比, 增益数值: 71 },
    ],
  },
  {
    五彩石名称: '彩·急速·破招·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·急速·鹤顶·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·急速·鹤顶·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 737 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·急速·无双·鹤顶(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1473,
      },
    ],
  },
  {
    五彩石名称: '彩·击破·固本·刚烈(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.全属性, 增益名称: 五彩石增益类型枚举.全属性, 增益数值: 228 },
      {
        增益类型: 属性类型.全会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
]

export default 五彩石_五级
