import { 属性类型 } from '@/@types/属性'
import { 装备增益可选类型类型, 装备特效增益数据, 装备特效枚举 } from '@/@types/装备'

const 装备增益数据 = {
  // 装备常见特效
  风特效腰坠: [{ 值: [23988, 27516], 属性: 属性类型.全破防等级 }],
  套装会心会效: [
    { 值: [0.04], 属性: 属性类型.全会心百分比 },
    { 值: [41], 属性: 属性类型.郭氏全会心效果等级 },
  ],
  常驻套装会心会效: [
    { 值: [7908], 属性: 属性类型.全会心等级 },
    { 值: [2914], 属性: 属性类型.全会心效果等级 },
  ],
  切糕会心: [{ 值: [2600, 2992], 属性: 属性类型.全会心等级 }],
  切糕无双: [{ 值: [2600, 2992], 属性: 属性类型.无双等级 }],

  // 大附魔
  大附魔_伤帽: [{ 值: [2611, 3001], 属性: 属性类型.全破防等级 }],
  大附魔_伤腰: [{ 值: [(0.038 * 8) / 30], 属性: 属性类型.通用增伤 }],

  // 节日特效
  龙门飞剑武器: [
    { 值: [(9070 * 6) / 30], 属性: 属性类型.全会心等级 },
    { 值: [(4320 * 6) / 30], 属性: 属性类型.全会心效果等级 },
  ],
  冬至套装: [{ 值: [543], 属性: 属性类型.全属性 }],

  // 副本精简常驻特效
  特效_2870: [
    { 值: [988], 属性: 属性类型.全会心等级 },
    { 值: [988], 属性: 属性类型.全破防等级 },
  ],
  特效_2872: [{ 值: [2824], 属性: 属性类型.无双等级 }],
  特效_2874: [{ 值: [1412], 属性: 属性类型.全破防等级, 可叠加: true }],
  特效_2875: [{ 值: [1412], 属性: 属性类型.全会心等级, 可叠加: true }],
  特效_2876: [{ 值: [1412], 属性: 属性类型.破招值, 可叠加: true }],

  // 试炼之地常驻特效
  试炼鞋子破防: [
    {
      值: [4218, 4391, 4072, 4393]?.map((增益) => 增益 * 0.5),
      属性: 属性类型.全破防等级,
    },
  ],
  试炼鞋子会心: [
    {
      值: [4218, 4391, 4072, 4393]?.map((增益) => 增益 * 0.5),
      属性: 属性类型.全会心等级,
    },
  ],
  试炼腰坠会效: [
    {
      值: [270, 282, 261, 282]?.map((增益) => 增益 * 5),
      属性: 属性类型.全会心效果等级,
    },
  ],
  试炼腰坠破防: [
    {
      值: [270, 282, 261, 282]?.map((增益) => 增益 * 5),
      属性: 属性类型.全破防等级,
    },
  ],
  // 大橙武特效
  大橙武特效: [
    {
      // 17100 18300 19500 20750 22000 23500 25000
      值: [671, 718, 765, 814, 864, 930, 997]?.map((增益) => 增益 * 5),
      属性: 属性类型.无双等级,
    },
  ],
} as { [key in 装备增益可选类型类型]: 装备特效增益数据[] }

const 功法特殊增益数据 = {
  内功: {
    水特效武器: [{ 值: [1710, 1960], 属性: 属性类型.全基础攻击 }],
    大附魔_伤衣: [{ 值: [791, 910], 属性: 属性类型.全基础攻击 }],
  },
  天罗诡道: {
    水特效武器: [{ 值: [1710, 1960], 属性: 属性类型.全基础攻击 }],
    大附魔_伤衣: [{ 值: [791, 910], 属性: 属性类型.全基础攻击 }],
  },
  外功: {
    水特效武器: [{ 值: [1530, 1760], 属性: 属性类型.全基础攻击 }],
    大附魔_伤衣: [{ 值: [710, 815], 属性: 属性类型.全基础攻击 }],
  },
}

const 装备特效存在等级: 装备特效枚举[] = [装备特效枚举.水特效武器, 装备特效枚举.风特效腰坠]

export { 功法特殊增益数据, 装备特效存在等级 }

export default 装备增益数据
