export default {
  "装备基础属性": {
    "基础攻击": 48573,
    "破防等级": 80507,
    "无双等级": 95234,
    "会心等级": 21062,
    "会心效果等级": 0,
    "全能等级": 0,
    "武器伤害_最小值": 4684,
    "武器伤害_最大值": 7806,
    "破招值": 85988,
    "力道": 44,
    "元气": 44,
    "身法": 44,
    "根骨": 8505,
    "体质": 157333,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 10093,
    "装分": 591793
  },
  "装备镶嵌附魔属性": {
    "基础攻击": 8529,
    "破防等级": 12816,
    "无双等级": 3916,
    "会心等级": 7289,
    "会心效果等级": 0,
    "全能等级": 0,
    "武器伤害_最小值": 0,
    "武器伤害_最大值": 0,
    "破招值": 12326,
    "力道": 44,
    "元气": 44,
    "身法": 44,
    "根骨": 616,
    "体质": 45,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 2801
  },
  "装备列表": [
    {
      "当前精炼等级": 6,
      "装备部位": "帽子",
      "附魔": "破招+2801",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSpiritBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 104770
    },
    {
      "当前精炼等级": 6,
      "装备部位": "衣服",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSpiritBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 104998,
      "附魔": "无双+836"
    },
    {
      "当前精炼等级": 6,
      "装备部位": "腰带",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 104892,
      "附魔": "无双+836"
    },
    {
      "当前精炼等级": 6,
      "装备部位": "护腕",
      "附魔": "会心+2801",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 104924
    },
    {
      "当前精炼等级": 6,
      "装备部位": "下装",
      "附魔": "破防+2801",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 104951
    },
    {
      "当前精炼等级": 6,
      "装备部位": "鞋子",
      "附魔": "破招+2801",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 104739
    },
    {
      "当前精炼等级": 6,
      "装备部位": "项链",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 43057
    },
    {
      "当前精炼等级": 6,
      "装备部位": "腰坠",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 42987
    },
    {
      "当前精炼等级": 6,
      "装备部位": "戒指",
      "附魔": "破招+2801",
      "镶嵌孔数组": [],
      "id": 43003
    },
    {
      "当前精炼等级": 6,
      "装备部位": "戒指",
      "附魔": "破招+2801",
      "镶嵌孔数组": [],
      "id": 43003
    },
    {
      "当前精炼等级": 6,
      "装备部位": "暗器",
      "附魔": "加速+2801",
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSpiritBase",
          "镶嵌宝石等级": 8
        }
      ],
      "id": 41177
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSpiritBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 41284,
      "装备部位": "武器",
      "附魔": "攻击+849"
    }
  ],
  "五彩石": "彩·灭气·激流·无双(陆)",
  "装备增益": {
    "大附魔_伤帽": 1,
    "大附魔_伤衣": 1,
    "大附魔_伤腰": 1,
    "大附魔_伤腕": 1,
    "大附魔_伤鞋": 1,
    "常驻套装会心会效": 1,
    "套装技能": 0,
    "切糕会心": 0,
    "切糕无双": 0,
    "特效_40790": 1,
    "特效_40788": 1,
    "特效_40793": 1,
    "风特效腰坠": 1,
    "特效_40802": 2,
    "水特效武器": 1
  }
}