export const 快捷添加数据: 快捷添加数据类型[] = [
  {
    名称: '三吞循环',
    技能序列: ['钟林毓秀', '商阳指', '阳明指', '商阳指', '阳明指', '商阳指', '阳明指', '玉石俱焚'],
    color: 'cyan',
  },
  {
    名称: '快雪双吞',
    技能序列: ['钟林毓秀', '商阳指', '快雪时晴', '阳明指', '商阳指', '阳明指', '玉石俱焚'],
    color: 'green',
  },
  {
    名称: '乱阳快商玉',
    技能序列: ['乱洒青荷', '阳明指', '快雪时晴', '商阳指', '玉石俱焚'],
    color: 'blue',
  },
  {
    名称: '阳商',
    技能序列: ['阳明指', '商阳指'],
    color: 'volcano',
  },
  {
    名称: '钟商',
    技能序列: ['钟林毓秀', '商阳指'],
    color: 'gold',
  },
  // {
  //   名称: '风劈',
  //   技能序列: ['骤风令', '骤风劈风'],
  //   color: 'gold',
  // },
  // {
  //   名称: 'CBC引A',
  //   技能序列: ['寒更晓箭', '金乌见坠', '白羽流星', '饮羽簇', '白羽流星', '引风唤灵', '劲风簇'],
  //   color: 'green',
  // },
]

export interface 快捷添加数据类型 {
  名称: string
  技能序列: string[]
  color?: string
}
