import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 生地狱 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '生地狱')

  constructor(模拟循环) {
    super(模拟循环)
    生地狱.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '生地狱')
    this.初始化技能运行数据()
  }

  命中() {
    const 缠绞层数 = this.模拟循环.当前目标buff列表?.['缠绞']?.当前层数
    this.保存释放记录('生地狱')
    this.模拟循环.添加buff?.({ 名称: '迭影', 对象: '自身', 新增层数: 1 })
    // this.模拟循环.添加buff?.({ 名称: '谐调', 对象: '自身', 新增层数: 1 })
    this.模拟循环.卸除buff?.({ 名称: '缠绞', 对象: '目标', 卸除层数: 5 })
    this.模拟循环.技能类实例集合?.勾线?.寄意减少CD?.()
    let 已读条时间 = -1
    const 读条开始时间 = this.模拟循环.当前时间
    const 待生效事件队列: 待生效事件[] = []
    for (let i = 0; i < 3; i++) {
      待生效事件队列.push({
        事件名称: '生地狱伤害生效',
        事件时间: 读条开始时间 + 已读条时间 + 5,
        事件备注: {
          技能名称: '生地狱',
          技能次数: i + 1,
          是否有连环慢: this.模拟循环.当前自身buff列表?.['连环慢']?.当前层数 ? true : false,
          是否在傀儡内: this.模拟循环.角色状态信息.状态 === '傀儡',
          缠绞层数: 缠绞层数,
        },
      })
      已读条时间 = 已读条时间 + 5
    }
    this.模拟循环.卸除buff?.({ 名称: '连环慢', 对象: '自身', 卸除层数: 1 })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  伤害生效(事件备注: { 是否有连环慢: boolean, 缠绞层数: number, 是否在傀儡内: boolean }) {
    const 当前缠绞层数 = this.模拟循环.当前目标buff列表?.['缠绞']?.当前层数
    this.触发伤害行为('生地狱', 1, [...(当前缠绞层数 ? [`缠绞·${当前缠绞层数}`] : []), ...(事件备注.是否有连环慢 ? ['连环慢'] : []), ...(事件备注.是否在傀儡内 ? ['傀儡系数增伤'] : [])], undefined, (事件备注.缠绞层数 || 0) + 1)
  }


  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['钤束', '虚影']),
    }
  }

}

export default 生地狱

export const 生地狱类型 = typeof 生地狱
