export const 快捷添加数据: 快捷添加数据类型[] = [
  {

    名称: '三盾击',
    技能序列: ['盾击', '盾击', '盾击'],
    color: 'blue',
  },
  {
    名称: '斩绝绝',
    技能序列: ['斩刀', '绝刀', '绝刀'],
    color: 'magenta',
  },
  // {
  //   名称: '行断',
  //   技能序列: ['行', '断'],
  //   color: 'volcano',
  // },
  {
    名称: '击业',
    技能序列: ['盾击', '业火麟光'],
    color: 'purple',
  },
  {
    名称: '斩击击',
    技能序列: ['斩刀', '盾回', '盾击', '盾击', '盾飞', '绝刀', '绝刀'],
    color: 'green',
  },
  // {
  //   名称: '停断',
  //   技能序列: ['停', '断'],
  //   color: 'red',
  // },
]

export interface 快捷添加数据类型 {
  名称: string
  技能序列: string[]
  color?: string
}
