export const 快捷添加数据: 快捷添加数据类型[] = [
  {
    名称: '生缚*5',
    技能序列: ['生地狱', '绊线', '绊线', '绊线', '绊线', '绊线'],
    color: 'cyan',
  },
  {
    名称: '勾进缚*5',
    技能序列: [
      '勾线',
      '落笼簿',
      '千里急',
      '千里急',
      '生地狱',
      '落笼簿',
      '绊线',
      '绊线',
      '绊线',
      '绊线',
      '绊线',
    ],
    color: 'cyan',
  },
  // {
  //   名称: '风劈',
  //   技能序列: ['骤风令', '骤风劈风'],
  //   color: 'gold',
  // },
  // {
  //   名称: 'CBC引A',
  //   技能序列: ['寒更晓箭', '金乌见坠', '白羽流星', '饮羽簇', '白羽流星', '引风唤灵', '劲风簇'],
  //   color: 'green',
  // },
]

export interface 快捷添加数据类型 {
  名称: string
  技能序列: string[]
  color?: string
}
