export default {
  "装备基础属性": {
    "基础攻击": 72685,
    "破防等级": 48671,
    "无双等级": 104758,
    "会心等级": 108682,
    "会心效果等级": 21290,
    "全能等级": 0,
    "武器伤害_最小值": 2737,
    "武器伤害_最大值": 4562,
    "破招值": 5856,
    "力道": 44,
    "元气": 6020,
    "身法": 44,
    "根骨": 44,
    "体质": 184036,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 11701,
    "装分": 683733
  },
  "装备镶嵌附魔属性": {
    "基础攻击": 11763,
    "破防等级": 5610,
    "无双等级": 7670,
    "会心等级": 2244,
    "会心效果等级": 3366,
    "全能等级": 0,
    "武器伤害_最小值": 0,
    "武器伤害_最大值": 0,
    "破招值": 1122,
    "力道": 44,
    "元气": 187,
    "身法": 44,
    "根骨": 44,
    "体质": 45,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 2089
  },
  "装备列表": [
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 107104,
      "装备部位": "帽子",
      "附魔": "攻击+633"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 106799,
      "装备部位": "衣服",
      "附魔": "无双+624"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 108665,
      "装备部位": "腰带",
      "附魔": "无双+624"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 106944,
      "装备部位": "护腕",
      "附魔": "无双+2089"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 106972,
      "装备部位": "下装",
      "附魔": "无双+2089"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 106735,
      "装备部位": "鞋子",
      "附魔": "攻击+633"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 44468,
      "装备部位": "项链",
      "附魔": "体质+361"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 8,
      "id": 47804,
      "装备部位": "腰坠",
      "附魔": "体质+361"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 44350,
      "装备部位": "戒指",
      "附魔": "攻击+633"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 44350,
      "装备部位": "戒指",
      "附魔": "攻击+633"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42798,
      "装备部位": "暗器",
      "附魔": "加速+2089"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSpunkBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42710,
      "装备部位": "武器",
      "附魔": "攻击+633"
    }
  ],
  "五彩石": "彩·无双·激流·月华(陆)",
  "装备增益": {
    "大附魔_伤帽": 2,
    "大附魔_伤衣": 2,
    "大附魔_伤腰": 2,
    "大附魔_伤腕": 2,
    "大附魔_伤鞋": 2,
    "试炼适应之力": 6,
    "常驻套装会心会效": 1,
    "套装技能": 0,
    "特效_42767": 2,
    "特效_40788": 2,
    "特效_40793": 2,
    "试炼项链会心": 6,
    "风特效腰坠": 2,
    "特效_40803": 2,
    "试炼暗器特效": 6,
    "水特效武器": 2
  }
}