import { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '斩涛·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101537.png',
        id: '101537',
        奇穴描述: '力道提高15%、移动速度提高10%。',
      },
      {
        奇穴名称: '砺身·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101538.png',
        id: '101538',
        奇穴描述: '自身受到伤害则获得15点{锐意}。',
        是否不可编辑: true,
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '披靡·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101539.png',
        id: '101539',
        奇穴描述: '施展招式回复{锐意}时，若{锐意}已满值，则自身伤害提高10%，持续12秒，可叠加2层。',
      },
      {
        奇穴名称: '狂潮·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101540.png',
        id: '101540',
        奇穴描述:
          '每施展2次【对阵招式】，命中侠士目标时，额外造成1次外功伤害并附带目标8%当前气血值的真实伤害。',
        是否不可编辑: true,
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '骇浪·悟',
        是否不可编辑: true,
        奇穴图片: 'https://icon.jx3box.com/icon/101541.png',
        id: '101541',
        奇穴描述: '施展【对阵招式】后3秒内，下次施展【傍身招式】命中时，获得15点{锐意}。',
      },
      {
        奇穴名称: '倒海·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101542.png',
        id: '101542',
        奇穴描述:
          '自身施加的{流血}最多可叠加3层，【留客雨·悟】命中已有{流血}的目标可使其获得1层{流血}。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '孤锋破浪·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101395.png',
        id: '101395',
        奇穴描述:
          '对前方造成伤害，自身每拥有30点{锐意}招式伤害提高25%。&lt;br/&gt;·自身{锐意}满值时可挥出刀气，返还5秒调息时间，对目标造成伤害并附带{截辕·悟}12秒。&lt;br/&gt;·自身{锐意}满值时施展可使自身会心率提高。',
      },
      {
        奇穴名称: '怒锋倾涛·悟',
        是否不可编辑: true,

        奇穴图片: 'https://icon.jx3box.com/icon/101396.png',
        id: '101396',
        奇穴描述:
          '冲向目标区域造成伤害。&lt;br/&gt;·可消耗30{锐意}使侠士目标额外受到20%当前气血值的{真实伤害}。',
      },
    ],
  },
]

export default 奇穴数据
