export default {
  "装备基础属性": {
    "基础攻击": 53942,
    "破防等级": 81353,
    "无双等级": 89142,
    "会心等级": 57645,
    "会心效果等级": 16180,
    "全能等级": 0,
    "武器伤害_最小值": 3044,
    "武器伤害_最大值": 5074,
    "破招值": 2244,
    "力道": 44,
    "元气": 44,
    "身法": 44,
    "根骨": 9343,
    "体质": 158670,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 12094,
    "装分": 589653
  },
  "装备镶嵌附魔属性": {
    "基础攻击": 11727,
    "破防等级": 6732,
    "无双等级": 7358,
    "会心等级": 4656,
    "会心效果等级": 0,
    "全能等级": 0,
    "武器伤害_最小值": 0,
    "武器伤害_最大值": 0,
    "破招值": 2244,
    "力道": 44,
    "元气": 44,
    "身法": 44,
    "根骨": 473,
    "体质": 1823,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 4802
  },
  "装备列表": [
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSpiritBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104752,
      "装备部位": "帽子",
      "附魔": "加速+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104783,
      "装备部位": "衣服",
      "附魔": "无双+717"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104690,
      "装备部位": "腰带",
      "附魔": "无双+717"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104921,
      "装备部位": "护腕",
      "附魔": "无双+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104950,
      "装备部位": "下装",
      "附魔": "无双+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104721,
      "装备部位": "鞋子",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42957,
      "装备部位": "项链",
      "附魔": "体质+889"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42987,
      "装备部位": "腰坠",
      "附魔": "体质+889"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 43002,
      "装备部位": "戒指",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 43002,
      "装备部位": "戒指",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSpiritBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 41177,
      "装备部位": "暗器",
      "附魔": "加速+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSpiritBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 41265,
      "装备部位": "武器",
      "附魔": "攻击+728"
    }
  ],
  "五彩石": "彩·星见·灭气·月华(陆)",
  "装备增益": {
    "大附魔_伤帽": 2,
    "大附魔_伤衣": 2,
    "大附魔_伤腰": 2,
    "大附魔_伤腕": 2,
    "大附魔_伤鞋": 2,
    "常驻套装会心会效": 1,
    "套装技能": 1,
    "特效_2869": 1,
    "特效_2872": 1,
    "风特效腰坠": 2,
    "特效_2875": 2,
    "水特效武器": 2
  }
}


